{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"The sea harbour of Porto Flavia, built in 1924. Sulcis-Iglesiense, Sardinia, Italy","url":"https://www.reddit.com/r/europe/comments/1rhv9f5/the_sea_harbour_of_porto_flavia_built_in_1924/","date":1772365317,"author":"/u/Socmel_","guid":343,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Russian Spy Ship Busted Red-Handed Launching Drone at French Aircraft Carrier","url":"https://united24media.com/latest-news/russian-spy-ship-busted-red-handed-launching-drone-at-french-aircraft-carrier-16375","date":1772364955,"author":"/u/UNITED24Media","guid":347,"unread":true,"content":"<p>Following the recent interception of&nbsp;a&nbsp;Russian unmanned aerial vehicle (UAV) in&nbsp;the port of&nbsp;Malmö, the Swedish Ministry of&nbsp;Defense has released specific operational details regarding the failed surveillance mission against the French aircraft carrier Charles de&nbsp;Gaulle. </p><div><div><p>We bring you stories from the ground. <b>Your support keeps our team in the field.</b></p></div><a href=\"https://united24media.com/donate?banner_variant=article_small\" target=\"_blank\">DONATE NOW</a></div><p>According to&nbsp;, the drone was <a href=\"https://%20https//www.reuters.com/world/europe/sweden-drone-french-aircraft-carrier-2026-02-27/\" rel=\"external noopener nofollow\" target=\"_blank\">launched</a> from the Russian Baltic Fleet’s reconnaissance vessel Zhigulevsk (Project 503R) while it&nbsp;was maneuvering in&nbsp;the Baltic&nbsp;Sea.</p><p>The Swedish patrol boat HSwMS Rapp, a&nbsp;Tapper-class vessel, had been tracking the Zhigulevsk prior to&nbsp;the drone’s deployment. </p><p>According to&nbsp;, the Swedish crew was <a href=\"https://defence-ua.com/news/rozkrito_detali_jak_rf_nahabno_shpiguvala_za_jedinim_avianostsem_frantsiji_i_chi_vdalosja_schos_zrobiti_iz_dronom-22011.html\" rel=\"external noopener nofollow\" target=\"_blank\">able</a> to&nbsp;document the exact moment of&nbsp;the UAV’s launch, providing visual and technical evidence that the surveillance attempt originated from the Russian naval asset.</p><p>While Swedish officials have not disclosed whether the drone was downed kinetically or&nbsp;via electronic warfare (EW), Vice Admiral Ewa Skoog Haslum confirmed that the spy equipment was fully neutralized upon approaching the French flagship.</p><p>“We&nbsp;monitored this vessel during its transit and were able to&nbsp;promptly take countermeasures when the drone was detected,” Vice Admiral Haslum stated, according to&nbsp;Defense Express.</p><h3><b>The role of&nbsp;modernized Swedish assets</b></h3><p>According to&nbsp;Reuters, the successful interception highlights the 2020&nbsp;modernization of&nbsp;Sweden’s Tapper-class fast patrol boats. </p><p>These vessels, which were nearly decommissioned in&nbsp;2014, were upgraded with advanced sensors specifically designed to&nbsp;detect small-scale reconnaissance drones even when operating in&nbsp;radio-silence mode.</p><p>The Swedish Defense Minister, Pål Jonson, confirmed on&nbsp;February 27, 2026, via social media that technical analysis verified the drone’s Russian origin. </p><p>According to&nbsp;Defense Express, the Zhigulevsk is&nbsp;part of&nbsp;the 72nd Separate Division of&nbsp;Special Purpose Ships and regularly conducts intelligence-gathering missions in&nbsp;the Baltic region.</p><p>The incident has resulted in&nbsp;the following developments:</p><ul><li><p>Intelligence analysis: NATO specialists are currently examining the recovered technical data and the drone’s hardware to&nbsp;assess Russian surveillance capabilities;</p></li><li><p>Heightened surveillance: following the breach, Baltic Sea nations have further intensified their maritime and coastal monitoring;</p></li><li><p>Operational security: the Charles de&nbsp;Gaulle has continued its scheduled participation in&nbsp;strategic exercises under a&nbsp;reinforced security umbrella.</p></li></ul><p>According to&nbsp;Reuters, the failure of&nbsp;the Russian operation reflects the high level of&nbsp;NATO naval readiness in&nbsp;the Baltic Sea. </p><p>Earlier, on&nbsp;February 4, <a href=\"https://united24media.com/latest-news/russias-spy-satellites-may-have-hijacked-european-signals-intelligence-warns-15622\" target=\"_self\">reported</a> that Russian Luch-1 and Luch-2 satellites likely hijacked unencrypted signals from over a&nbsp;dozen European spacecraft. German military space command told Financial Times that these maneuvers targeted sensitive government and military data, warning that Russia could potentially spoof commands to&nbsp;deorbit or&nbsp;crash older, unencrypted satellites.</p>","contentLength":3021,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1rhv5qc/russian_spy_ship_busted_redhanded_launching_drone/"},{"title":"Belgium, France seize Russian 'shadow fleet' tanker in the North Sea","url":"https://www.france24.com/en/europe/20260301-belgium-france-seize-russian-shadow-fleet-tanker-in-north-sea","date":1772361007,"author":"/u/HighDeltaVee","guid":342,"unread":true,"content":"<p>Deputy Prime Minister Maxime Prévot said the vessel was intercepted in the North Sea during an overnight operation.</p><p>\"Today, a vessel from Russia's shadow fleet was intercepted in the North Sea,\" Prévot wrote on X, thanking Belgian special forces for their \"exceptional professionalism and courage\".</p><p>Belgian Defence Minister Theo Francken said the intercepted tanker was \"being escorted to the port of Zeebrugge, where it will be seized\".</p><p>French President <a href=\"https://www.france24.com/en/tag/emmanuel-macron/\" target=\"_self\">Emmanuel Macron</a> confirmed on X that French naval forces assisted in the operation, calling it a \"major blow\" to Russia's so-called shadow fleet.</p><div data-xtwitter-script=\"\"><div><div><p>To display this content from X (Twitter), you must enable advertisement tracking and audience measurement.</p></div></div></div><p>Russia has used a flotilla of ageing tankers of opaque ownership to get around restrictions on its lucrative crude exports imposed over its 2022 all-out invasion of Ukraine.</p><p>The European Union has blacklisted hundreds of vessels in a bid to sap Moscow's war chest.</p><p>\"Sanctions only matter if they are enforced. Today, we enforced them,\" Prévot said.</p><p>Francken told Reuters that the seized vessel was suspected of sailing with a \"false flag ⁠and false documents\".</p><p>Maritime tracking site VesselFinder reports the Ethera is sailing under a Guinean flag.</p><p>The operation was carried out alongside Belgium's G7, Nordic and Baltic partners and in coordination with France, he added.</p><p>Russia has called the seizure of its tankers or ⁠vessels carrying its ​cargoes an act of piracy.</p><p><em>(FRANCE 24 with AFP and Reuters)</em></p>","contentLength":1506,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1rhu1qc/belgium_france_seize_russian_shadow_fleet_tanker/"},{"title":"\"We Know that the Kremlin is Very Worried\" – Interview with Estonian Foreign Intelligence's Top Analyst","url":"https://vsquare.org/we-know-that-the-kremlin-is-very-worried-interview-with-estonian-foreign-intelligences-top-analyst-andres-vosman/","date":1772356773,"author":"/u/dat_9600gt_user","guid":340,"unread":true,"content":"<p><strong>For the past five years, Andres Vosman was responsible for analyzing intelligence on Russia at Estonia’s Foreign Intelligence Service (EFIS), until his appointment as ambassador to Israel in August. He gave his <a href=\"https://balticflank.substack.com/p/we-know-that-the-kremlin-is-very\">first comprehensive interview</a> to Estonian investigative journalist Holger Roonemaa. The interview took place just days before the US raid in Venezuela.</strong></p><div><img decoding=\"async\" aria-describedby=\"caption-attachment-8916\" src=\"https://vsquare.org/wp-content/uploads/2026/01/46ee3dc4-bf4b-49b8-92a7-7d450e59fbb1_5769x3846.webp\" alt=\"\" width=\"1456\" height=\"971\" srcset=\"https://vsquare.org/wp-content/uploads/2026/01/46ee3dc4-bf4b-49b8-92a7-7d450e59fbb1_5769x3846.webp 1456w, https://vsquare.org/wp-content/uploads/2026/01/46ee3dc4-bf4b-49b8-92a7-7d450e59fbb1_5769x3846-300x200.webp 300w, https://vsquare.org/wp-content/uploads/2026/01/46ee3dc4-bf4b-49b8-92a7-7d450e59fbb1_5769x3846-1024x683.webp 1024w, https://vsquare.org/wp-content/uploads/2026/01/46ee3dc4-bf4b-49b8-92a7-7d450e59fbb1_5769x3846-768x512.webp 768w, https://vsquare.org/wp-content/uploads/2026/01/46ee3dc4-bf4b-49b8-92a7-7d450e59fbb1_5769x3846-400x267.webp 400w\" sizes=\"(max-width: 1456px) 100vw, 1456px\"><p>Andres Vosman. Photo: Priit Simson / Delfi Meedia</p></div><p><strong>Let’s start with a trivia question. Faith, hope, love, peace, anxiety, or victory? Which of these words best characterizes the emotional world of Russian society?</strong></p><p>One can probably find matches for all keywords, but I think the word ‘anxiety’ characterizes it most generally. Russian people are increasingly asking where is this much and long promised victory. They probably see difficulties related to their subsistence and many are worried about the future. But there are many words characterizing Russian society that were not in your list: indifference, switching off, brainwashing.</p><p><strong>I am glad that I am interviewing the right person. Readers of the bookstore “Читай-город” (Chitai-gorod) overwhelmingly chose “anxiety” as the Russian word of the year. How can anxiety express itself in such a closed and repressive society?</strong></p><p>For the majority, it expresses itself in dealing with other things. They don’t think big or socially. It certainly expresses itself in self-censorship. In many ways, Russia has long been back in the Soviet era. The only question is whether it is the year 1937 or 1984, meaning whether it will get even worse or if the bottom has been reached and perestroika will come.</p><p>I do not predict perestroika in the near future today. At the same time, all pivotal events in Russia have occurred with a short fuse. Working in intelligence and making forecasts has made me very cautious, and especially regarding Russia, I wouldn’t make long forecasts, but no ray of optimism shines there. Brains have left, people are full of violence. They are willing to turn a blind eye to whatever evil.</p><p>The hope is that if at one moment Russian people have to choose between the television and the refrigerator, the refrigerator will win. If there is nothing left in the refrigerator, people might suddenly come to the streets and that is the end of this regime. I certainly hope for Putin’s end. Whoever comes after him, a time of confusion will follow. Russia’s attention will certainly be on internal problems for some time, and this is not pleasant for any dictatorship. There will certainly not be any natural selection where someone simply takes over Putin’s place.</p><p><strong>How does the Kremlin itself understand this and how much does Putin’s gang monitor what is happening in society?</strong></p><p>The Kremlin monitors societal processes and moods very keenly. It micromanages what happens in Russia at the most local level. The Kremlin receives real-time overviews of what is happening in local municipalities, settlements. Every dictatorship is worried about losing control and therefore uses surveillance methods.</p><p>We know that the Kremlin is very worried about how to mitigate potential tensions with likely radicalized or disappointed men returning from the war. The Kremlin and FSB monitor these developments very keenly, including all sorts of religious movements, for example neo-paganism. Russia cannot control such things like it controls the Orthodox Church. Russia lacks the capacity to deal with such fundamental problems. Hundreds of thousands of men will come demanding prostheses, demanding hero status, maybe sweet positions. A separate topic is the proliferation of weapons after the war.</p><p>All that alcoholism, PTSD – Russia simply is not ready to deal with this. We see what the level of Russian healthcare is. Thus I forecast that the end of the war will be difficult for Russia.</p><p><strong>So the end of the war and the possible gradual lifting of sanctions would not mean a certain liberation for Russia?</strong></p><p>It might create short-term euphoria for a moment. Maybe the economy even goes up a few percent. But this of course depends on the details, to what extent sanctions go off and on what conditions the war ends. In the long run, Russia faces fundamental problems, primarily related to the economy.</p><p><strong>You mentioned impoverishment. Such a word is not really used about the conditions prevailing in Russia so far. Rather, the conventional wisdom says that sanctions have not had a visible impact on the ordinary person’s life. True, over the last half year there have been more danger signs hanging over the Russian economy, but not impoverishment.</strong>\nThe ordinary person’s income is largely at the same level as it was around the year 2010. This means 15 years of stagnation. But let’s look at the future. What are Russia’s perspectives? Essentially, it is increasingly an economy under China’s control, a raw material warehouse. They have oil, gas, rare earth metals and other metals, but Russia cannot produce anything [meaningful] itself or create new quality. If we leave the war industry aside, then how to cope in the competition of international economy, where keywords are AI, smart technologies, international interaction on scientific level? In this big game, Russia has moved backward a lot in recent years. I don’t see that anything would get better for Russia. Oil price forecasts are rather downward. Their liquid reserves are essentially out.</p><p><strong>Which of those same nominees for Russia’s word of the year characterizes Estonian society the most?</strong></p><p>I think anxiety as well. It is persistent. It is inherent to us, we are a small nation and live next to a serial killer neighbor. Maybe it is also a force motivating us to act. But on the other hand, it is also a factor eating our confidence and exhausting us.</p><p><strong>How often do your friends ask you when will the war start?</strong></p><p>Very often. It happens a lot and I am depressed that there is so much of this anxiety. I am also anxious about Ukraine and at times depressed by the news, but regarding our own security we could be significantly more confident. This doesn’t mean that everything is fine and the end of history has arrived. Putin’s Russia needs constant monitoring, we must constantly validate our assumptions. But the “is Narva next” questions are indeed frustrating.</p><p><strong>What do you tell your friends who ask when the war starts?</strong></p><p>A conventional war against Estonia is not very likely in the near future for various reasons. But we must prepare for it, because we live next to a sick and by nature aggressive state.</p><p>First, everything I know about Russia’s thinking, Russia’s vision of the world, Russia’s intent, and war against the Baltics does not figure there. I do not know that there is currently or has been in recent years an intent to militarily attack the Baltics. We are in NATO. NATO, last I checked, is still operating. Russia takes Article 5 seriously.</p><p>We see every day how Russia actually very consciously calibrates how far it goes with certain things. For example, if we take the ongoing sabotage campaign. Certain things are sort of okay for Russia, but certain things are not.</p><p><strong>What for example is not okay regarding sabotage?</strong></p><p>Terror attacks with large civilian casualties. For example against passenger planes, which sort of was on the table. When Western intelligence found out about this and escalated it to the political level, this thing was put on hold [in the Kremlin], because it was understood that this is playing with fire.</p><p>Here is also a paradox. General top-down orders are characteristic of the Russian system and then some officials with lower than average IQ carry out these orders and sometimes improvise in hopes of doing favors for the Czar. Due to which mistakes can happen and this is dangerous. With Russia one must always be on guard.</p><p>The biggest danger for us is a miscalculation in Moscow. As is known, they also miscalculated in Ukraine, although Putin has wanted Ukraine back from day one. Estonia does not belong to the so-called Russian world (). We are not part of this core Russia for Putin or his inner circle like Ukraine or Belarus are. Russia currently lacks the intention to occupy part of the Baltics, but this may change in time. So I always emphasize the temporal definition, because it is also the task of intelligence to check and validate these assumptions every day.</p><p>The second reason is our NATO membership and thirdly the Ukraine war, which is a limiting factor for Russia. Russia has completely tied itself militarily to the Ukraine direction. Even when the war ends, a considerable part of the Russian army will likely remain tied to Ukraine. So any military attack involving many risks against NATO, for example in the Baltics, would likely force Russia to free up very large resources from elsewhere. It is not like the Pskov 76th Air Assault division will get an order and it’s done. There are very many things that can go wrong.</p><p><strong>At the same time, throughout the last year we have read and heard countless claims to the contrary from Europe, Ukraine, and even the U.S. Chancellor Merz talks about how Putin’s goal is to restore the Soviet Union. Budanov says that Putin will not stop with Ukraine and so on. Again, different experts have started putting a year number on when Russia will attack or be ready to attack the Baltics.</strong></p><p>Often what Western intelligence says about Russia’s capability relies on the assumption that the war with Ukraine will end and Russia achieves its goals there. Russia has so far not achieved any of its major goals in Ukraine. So these are hypothetical scenarios, but primarily in terms of forecasting capability. Often no distinction is made between intent and capability.</p><p>Indeed there have been different statements in the media, but it is not my business to comment on them. I know that Estonian intelligence assessments of the Russian threat do not differ from the assessments of our most capable intelligence partners.</p><p>Regarding the statements of Ukrainian intelligence leaders about the Baltics not only this year, but also earlier, these are largely caused by the desire to create an attitude of certain urgency or acuteness in the West, which would make them deal with Russia more forcefully. So we are a bit like collateral damage.</p><p>The statements of Western politicians and intelligence services are often related to addressing domestic audiences. For example in the case of Germany, with the desire to create some resonance in society for example to increase defense spending. The Baltics is a convenient example to use. The media is also to blame, which amplifies and sometimes takes things out of context to create a shinier headline.</p><p><strong>On the last day of 2025, another ship carrying Russian cargo cut the undersea cables between Estonia and Finland. Estonian security agencies have held the position that all these incidents have not been organized by Russian intelligence. Why do you assess so?</strong></p><p>One should ask the security agencies, but I will say this much, that it is likely in Russia’s interests to keep the Baltic Sea as problem-free and navigable as possible, since their export, as well as connections with Kaliningrad, depend on the stability of the Baltic Sea.</p><p>Every such incident brings new calls for restrictive actions regarding the shadow and other fleets, NATO missions, sanctions. Looking strategically, Moscow doesn’t need this mess. At the same time,&nbsp;&nbsp;(disorder/mess) also characterizes Russia, due to which one cannot always rule out a situation where one hand doesn’t know what the other is doing.</p><p>My strong assessment is that predominantly the Baltic Sea incidents of recent years have been caused by a coincidence of circumstances – significantly larger shipping traffic in the Russian direction, vessels in poor condition and crews with low professionalism, more underwater infrastructure than before, greater public attention. Broken anchor devices cut underwater cables in stormy conditions earlier as well, but these incidents weren’t talked about. At the same time, the longer the West collectively allows the shadow fleet to rally on the Baltic Sea, the more likely it is only a question of time when the next thing happens.</p><p><strong>There has recently been a lot of talk about Europe and NATO needing to start paying Russia back regarding sabotage and take counter-activities to Russian territory. Most recently, for example, the head of the NATO Military Committee Giuseppe Dragone presented such a line of thought. Is this a realistic plan?</strong></p><p>This is talking about something that should be obvious. Why talk about it at all. If Russia is in a so-called hybrid war against us, then it seems reasonable to stand against it. One part of standing against it is also offensive activity.</p><p><strong>Maybe these statements are also part of this same search for confidence that the US reproaches us for?</strong></p><p>Agreed. After all, a large part of Europe continues to live in the hope that these problems will just disappear. I subscribe to America’s reprimanding attitude towards Europe, especially regarding defense spending.</p><p><strong>Why don’t we have this confidence in Estonia?</strong></p><p>This stems from our smallness and history, but is clearly also linked to international developments on the other side of the ocean, which has made people more anxious. Being now in Israel, which is one of the most self-confident societies of all, I think that without it, it is hard to survive. You have to believe in yourself, in your friends, and be ready to act.</p><p><strong>But Europe is not small neither geographically nor in terms of population. 450 million people live in the EU. The economy is many times larger than Russia’s. What explains the lack of confidence in Estonian society cannot explain the same in Europe.</strong></p><p>From our view the situation is not perfect. Europe often does not speak with one voice. This cacophony is written into EU’s architecture. Unfortunately there are also member states who work against it. But let’s rewind ourselves back to February 2022. Would anyone have predicted that now four years later we are working out the 20th sanctions package, tightening the screw all the time? Yes, in our assessment things take too long and are at times full of exceptions and gaps, but in the big picture relative unanimity and readiness to support Ukraine prevail.</p><p><strong>In the Russian word of the year competition, </strong><strong>&nbsp;was also put to a vote. Put into an endearing-sarcastic form, that term roughly translates as a secret agreement, a reference to negotiations going on through US mediation. Why is Russian society so sarcastic regarding these negotiations?</strong></p><p>Sarcasm is inherent to Russian society in general. It comes from the Soviet time, that one cannot believe everything the mass media says. I think that currently the attitude is simply widespread that one cannot actually negotiate with the West, one cannot trust the West. Therefore they are skeptical regarding all sorts of agreements. The West is conversely just as skeptical [towards Russia].</p><p><strong>How would you analyze the current negotiations?</strong></p><p>It is hard for me to comment because I don’t know the latest status, but it seems a kind of round game is going on. We have already been in this place before, where through the words of the US president it was said that a breakthrough is expected any moment. We have also heard before that Putin wants peace. In actions we do not see this in any way. I am skeptical regarding any significant breakthrough in the coming months. At the same time the situation for Ukraine could also be much worse, so the glass is simultaneously half full and half empty.</p><p><strong>The Wall Street Journal published recently how it was Putin who lured Steve Witkoff to be the US chief negotiator and that this chain went through Saudi Arabia. Why did the Kremlin need specifically a man like Witkoff to negotiate and not for example Secretary of State Marco Rubio?</strong></p><p>Witkoff declares that he is a master of deal making and open to deals. Russia certainly uses different levers very cunningly in negotiations and one of the biggest levers is all sorts of flatteries, promises for deals and other benefits accompanying it. I very much hope that Western negotiators see through this. Russia has certainly consciously looked for such dealmakers.</p><p><strong>On the other hand Russia itself has now replaced the pseudo-historian Vladimir Medinsky with Kirill Dmitriev, who similarly lacks any diplomatic background, but in other regards is perhaps more credible.</strong></p><p>Dmitriev has a US background, he has lived in the US. Dmitriev himself has also been very interested in being in this role. I think Putin uses him as long as needed and at one moment, when his contribution is no longer useful, he will be pushed aside. Dmitriev is another pawn, he is certainly not any decider in the Russian system. His coming into this game has created competition in other Russian players as well. It is inherent to Putin to use different levers and wait who brings a better result, and at the same time keep all options open.</p><p><strong>Q: Witkoff is a dealmaker and ready for deals, but it seems to me that the US and Russia are pursuing very different things in negotiations. Trump, Witkoff, Jared Kushner want a deal, be it financial or business, and Putin exploits this. Putin himself, however, proceeds from an ideological strategy and one of establishing “historical truth”.</strong></p><p>I think you are right. For a large part of today’s US administration, Russia’s war in Ukraine is an unpleasant distraction that should be packed up quickly to deal with main topics, be they South America or China topics.</p><p><strong>Does Putin also want to make a deal?</strong></p><p>Putin wants a deal on his own terms. For him control over Ukraine seems to be an existential question of his legacy in Russian history. Ukraine is a topic that has passionately captivated Putin for over 20 years. Putin is not any historian, but already since the late 1990s he seems to believe that Russia cannot restore its greatness without controlling Ukraine and Belarus. These three countries form the so-called core Russia for him. When Putin talks about Russia’s greatness and growth, about Russia’s borders, then he primarily means these three.</p><p>This war is not about Donbas or the Crimea land connection. For Putin this war is still about control over Kyiv. Kyiv does not necessarily have to be conquered for this, but a pro-Russian government must be installed. Currently this does not seem doable from any angle. Ukraine has shed too much blood for this.</p><p><strong>Especially if as a result of whatever negotiations Ukraine should give up Donbas or some part of unconquered territory?</strong></p><p>Maybe it would mean a pause in the war, but not the end of it. It is a separate question on what conditions this pause would arise for Russia, what happens to sanctions, what happens to demobilized soldiers. As much as the Western intelligence community knows, Putin has not given up on his goals. He has likely corrected his timeframes, but there are no references that he has given up on his final goal. The good news is that the final goal does not look significantly closer to Russia than it was four years ago.</p><p><strong>How long will Russia last and how long will Ukraine last, assuming a peace treaty will not be agreed on?</strong></p><p>Very hard to say. If new forceful sanctions were to hit Russia, Russia’s resilience would be more fragile. If some economic cataclysm were to happen in the world that brings oil prices down, Russia’s resilience will be more fragile. Or a natural catastrophe that directs attention and resources elsewhere. There are more and more of these possibilities.</p><p>In Ukraine’s case there are fewer of these possibilities, since Ukraine has been in a very difficult state for a sufficiently long time. Ukraine’s problem is primarily a shortage of personnel, but I do not see signs that Ukraine would be ready to give up. Because they know what the alternative is. They have no choice. As long as at least European support remains, and it seems to me that a very large part of Europe is still and strongly behind Ukraine, then I think Ukraine will hold out. This does not mean that it is easy for them or that they will not lose more territory.</p><p><strong>Besides the question of conceding territory, the other important chapter of the negotiations is about security guarantees to Ukraine. What basis is there to even believe and assume the validity of such agreements in case the guarantee will need to be activated?</strong></p><p>Doubt regarding the validity of agreements and promises has likely grown, but whether this mistrust has now taken over completely, I am not sure. Among other things, I think, for example, that Russia continues to consider NATO Article 5 valid and does not wish to test it at the moment. As for Ukraine’s security guarantees, the key question is whether the guarantors are ready to go to war with Russia for Ukraine’s security. This is a black-and-white question. If the answer is yes, then the guarantees are credible.</p><p><strong>My question targets Europe at least as much as the US. You said that today there is great support for Ukraine. But if we look a few years ahead, which elections are coming up in various European countries and which parties might come to power, then I do not have confidence that any guarantee or agreement regarding Russia would hold.</strong></p><p>Regarding Article 5, it does not seem to me that President Trump would want to go down in history as the president during whose time Article 5, and consequently NATO, lost its credibility, its functionality, and is thrown into the trash bin of history. Trump does not seem to me to be a politician who would want to be a loser. He wants to be a winner. I think Russia sees him that way too. Considering also the moods in the Congress, the moods of the American society and its political establishment, which are generally, to put it mildly, critical of Russia, I do not see why an American president would somehow want to go down in history [as the destroyer of NATO]. The situation is of course dynamic and maybe in a year there will be some other winds blowing.</p><p><strong>A month ago, the US confirmed a new National Security Strategy. It contains statements about Europe’s civilizational erasure, lack of self-confidence in relations with Russia, and so on. How tragically should we take the NSS?</strong></p><p>Lack of self-confidence is of course a correct diagnosis. I am not the ambassador to the US and it is not my place to give assessments, but it simply seems to me that during Trump’s time, any strategy document does not possess the value it would have at some other time. It is not characteristic of Trump to act within the framework of strategies written up by officials. This document was likely written in a relatively short time by a handful of people. Also, the entire communication of this document was different than before, which makes one ask how programmatic or strategic it actually is. It is full of slogans characteristic of the MAGA movement. My personal opinion is that we should not pay very much attention to this strategy.</p><p><strong>The other document, adopted a bit later, is the National Defense Authorization Act (NDAA), which does not come from the White House, but from the Congress. The NDAA seems to me to be much more optimistic, precisely in the part concerning Europe, Estonia and the Baltic states.</strong></p><p>Yes, the Baltics are the benchmark of good allies from Washington’s view. Estonia generally has a good image in Washington. We say what we do and we do what we say. We don’t go around whining, but also offer solutions ourselves. All this ties in with the new winds in Washington. The fact that American financial aid for Baltic defense investments was cemented is certainly an important milestone.</p><p><strong>Compared to before, the funding earmarked for the Baltic Security Initiative is even growing.</strong></p><p>I would recommend taking note of this fact to many of those who are extremely worried about America’s stance in Europe. I am not one of those who would be declaring the end of NATO. Yes, NATO is probably neither the most urgent nor the most popular topic for Washington policy makers at the moment, but in a few years we may again be in a situation where NATO will again be very topical in Washington as well, for example due to China. It is not known to me that there would be an intention in Moscow to test NATO in connection with America’s new administration or alleged weakness. On the contrary, I think that the unpredictability characteristic of Trump and the readiness to use military force in various places in the world has made Russia somewhat more concerned.</p><div><div><a href=\"https://vsquare.org/author/hroonemaa/\"></a><p>Head of the investigative desk at Delfi Estonia, Holger Roonemaa has extensively investigated topics related to national security, including Russia’s espionage, interference, and influence operations in Estonia and the wider region. He is a member of the International Consortium on Investigative Journalists (ICIJ). Estonia’s national media association named him the journalist of the year in 2020 and 2021.</p></div></div>","contentLength":24903,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1rhsvzt/we_know_that_the_kremlin_is_very_worried/"},{"title":"Poland asks EU Parliament to strip far-right leader Braun of immunity to face Holocaust denial charge","url":"https://notesfrompoland.com/2026/02/28/poland-asks-eu-parliament-to-strip-far-right-leader-braun-of-immunity-to-face-holocaust-denial-charge/","date":1772356737,"author":"/u/dat_9600gt_user","guid":341,"unread":true,"content":"<div><h3>Keep our news free from ads and paywalls by making a donation to support our work!</h3><div><img decoding=\"async\" data-src=\"https://notesfrompoland.com/wp-content/uploads/2023/07/support.png\" alt=\"\" width=\"275\" height=\"97\" src=\"data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\"><p>Notes from Poland is run by a <a href=\"https://notesfrompoland.com/about-us/#editor-team\">small editorial team</a> and is published by an independent, non-profit foundation that is funded through donations from our readers. We cannot do what we do without your support.</p></div></div><p>Poland’s justice minister has asked the European Parliament to again strip Polish far-right leader Grzegorz Braun of legal immunity so that he can face charges in his homeland for denying German-Nazi crimes, an offence that carries a potential three-year jail term.</p><p>He is accused of refuting the fact that gas chambers were used to kill victims at the Auschwitz and Majdanek camps.</p><p>Braun is <a href=\"https://notesfrompoland.com/2025/12/08/trial-of-polish-far-right-leader-for-attacking-jewish-celebration-in-parliament-begins/\">already on trial</a> in Poland for a number of other alleged crimes, including attacking a Jewish religious ceremony in parliament. Now prosecutors also wish to charge him under a law that makes it a criminal offence to “publicly and contrary to the facts deny” Nazi or communist crimes.</p><p>“There is and will be no consent to distorting history and breaking the law,” wrote justice minister Waldemar Żurek, announcing on Friday that he had asked the European Parliament to lift Braun’s immunity.</p><p>“This is a question of historical truth, respect for the victims, and accountability for one’s words,” added Żurek, who also serves as prosecutor general. “The Polish state has a duty to respond to the denial of Nazi-German crimes.”</p><p>Żurek revealed that the accusation against Braun relates to “denial of genocide crimes committed by functionaries of the Third Reich in the Auschwitz-Birkenau concentration camp and the Lublin concentration camp (Majdanek)”.</p><p>In a further statement, Poland’s Institute of National Remembrance (IPN), a state historical body that has prosecutorial power, said that the accusation related to the use of gas chambers at those two camps.</p><p>Neither the IPN nor Żurek confirmed what specific words Braun had said that prompted the planned charges against him. However, the IPN noted that they had come at a live event broadcast online on 27 September 2025.</p><p>On that date, Braun took part in a discussion with Jan Żaryn, a right-wing historian and former senator for the national-conservative Law and Justice (PiS) party, titled “The Polish Underground State and the Jewish Issue”. A&nbsp;recording of the event is still available online.</p><p>During his remarks, Braun referred to the “fake gas chambers of Majdanek and Auschwitz”, calling them “a dark, monstrous fantasy that has no satisfactory historical or academic support”.</p><p>He suggested that the idea of the gas chambers had been invented as part of “propaganda and black PR operations conducted by the Soviet and Anglo-Saxon security services during World War Two”, and that the false claim continues to be exploited by Jews today.</p><p>In actual fact, historians estimate that around 900,000 people were killed in the gas chambers at Auschwitz. The vast majority were Jews, but victims also included Roma, Soviet prisoners of war, and ethnic Poles.</p><p>Meanwhile, gas chambers at Majdanek were used to kill tens of thousands, again mainly Jews. Today, the ashes of the camp’s cremated victims are preserved in a memorial at the site of the former camp.</p><p>Braun, who has a long history of promoting antisemitic conspiracy theories, has repeatedly sought to cast doubt on the veracity of Nazi crimes against Jews.</p><p>In a separate interview in July last year, he also <a href=\"https://notesfrompoland.com/2025/07/10/polish-far-right-leader-declares-auschwitz-gas-chambers-to-be-fake/\">called</a> the gas chambers at Auschwitz “fake”. In response, Żurek <a href=\"https://notesfrompoland.com/2025/09/05/poland-asks-eu-parliament-to-strip-far-right-leader-of-immunity-over-holocaust-denial-charges/\">filed a similar request</a> to lift Braun’s immunity so that he could face charges for denying Nazi crimes.</p><p>The European Parliament – which can strip an MEP’s immunity by a majority vote among their fellow MEPs – is still processing that request.</p><p>In December, Braun <a href=\"https://notesfrompoland.com/2025/12/08/trial-of-polish-far-right-leader-for-attacking-jewish-celebration-in-parliament-begins/\">went on trial</a> over a separate set of charges relating to four other incidents, including his <a href=\"https://notesfrompoland.com/2023/12/12/far-right-mp-expelled-from-polish-parliament-after-spraying-hanukkah-candles-with-fire-extinguisher/\">attack</a> on a celebration of the Jewish festival of Hanukkah in parliament in December 2023 and his <a href=\"https://notesfrompoland.com/2023/05/31/far-right-mp-forces-abandonment-of-holocaust-scholars-lecture-at-german-institute-in-warsaw/\">disruption of a lecture</a> by a Holocaust scholar.</p><p>“I am standing before this court because I dared to defend myself against oppression and the ritual manifestation of Jewish supremacy,” declared Braun at the start of the trial.</p><p>In November, the European Parliament <a href=\"https://notesfrompoland.com/2025/11/13/polish-far-right-leader-braun-again-stripped-of-legal-immunity-by-european-parliament/\">also stripped Braun of immunity</a>&nbsp;to face charges for six alleged crimes, including inciting religious hatred against Jews, assaulting a doctor involved in carrying out a late-term abortion, and&nbsp;<a href=\"https://notesfrompoland.com/2025/03/20/police-investigating-far-right-presidential-candidates-vandalism-of-lgbt-exhibition-in-poland/\">vandalising</a>&nbsp;an LGBT+ exhibition.</p><p>Amid his legal troubles, Braun has seen his popularity rise. When he stood as a candidate in last year’s presidential election, he began as a rank outsider but ended up <a href=\"https://notesfrompoland.com/2025/05/19/narrow-win-in-polish-presidential-election-first-round-for-trzaskowski-who-will-face-nawrocki-in-run-off/\">finishing fourth</a>, with 6.3% of the vote, following a campaign characterised by antisemitic, anti-Ukrainian and anti-LGBT+ rhetoric.</p><p>Meanwhile, the radical-right party that he leads, Confederation of the Polish Crown (KKP), has <a href=\"https://notesfrompoland.com/2025/12/17/poll-shows-party-of-polish-far-right-leader-grzegorz-braun-rising-to-third-place/\">surged in the polls</a>, where it now averages support of around 8%.</p><p><img decoding=\"async\" data-src=\"https://notesfrompoland.com/wp-content/uploads/2023/07/support.png\" alt=\"\" width=\"275\" height=\"97\" src=\"data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMSIgaGVpZ2h0PSIxIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPjwvc3ZnPg==\">\nNotes from Poland is run by a <a href=\"https://notesfrompoland.com/about-us/#editor-team\">small editorial team</a> and published by an independent, non-profit foundation that is funded through donations from our readers. We cannot do what we do without your support.</p><p><em>Main image credit: Genevieve Engel, © European Union 2025 – Source : EP</em></p><div itemtype=\"http://schema.org/Person\" itemscope=\"\" itemprop=\"author\"><div><div><div itemprop=\"description\"><p>Daniel Tilles is editor-in-chief of&nbsp;. He has written on Polish affairs for a wide range of publications, including&nbsp;,&nbsp;,&nbsp;&nbsp;and&nbsp;.</p></div></div></div></div>","contentLength":5319,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1rhsvo8/poland_asks_eu_parliament_to_strip_farright/"},{"title":"Dutch Tax Authority hands US software company full responsibility over VAT system","url":"https://www.techzine.eu/news/infrastructure/139152/dutch-tax-authority-hands-us-software-company-control-over-vat-system/","date":1772349945,"author":"/u/throwaway490215","guid":345,"unread":true,"content":"<p><b>The Tax Authority has placed the management of the new VAT system entirely in the hands of the American company FAST Enterprises. With 1.5 billion euros per week in VAT revenue at stake, there are now serious concerns about digital sovereignty.</b></p><p>If that revenue of €1.5B a week disappears, the state will have to quickly borrow more on the international capital market. In theory, America could stop this process in the Netherlands thanks to a new tender, <a href=\"https://berthub.eu/articles/posts/btw-as-an-american-service/\" target=\"_blank\">says</a> Dutch tech commentator Bert Hubert.</p><p>Last year, FAST Enterprises won a <a href=\"https://www.computable.nl/2025/02/18/capgemini-daagt-staat-om-nieuw-systeem-omzetbelasting/\" target=\"_blank\">€190 million tender for</a> the renewal of VAT processing. However, the tender documents show that the American company is not only supplying software. FAST will also supply the servers, manage the software, and provide maintenance. And all of this will be done remotely, from the US. With BTW being the local term for VAT, Hubert calls the current situation “BTW-as-a-service” due to the lack of control.</p><p>The “turnkey solution” as described in the tender includes equipment, system software, configuration, maintenance, and management. The new solution will also have access to 20 to 25 other applications within the Tax and Customs Administration. It is unclear exactly which ones these are; they could be purchased systems or locally developed applications (LOAs).</p><p>Given that the tender process has been ongoing for years, it is clear that the choice of an American IT supplier was made without knowledge of the current geopolitical tensions. Criticism has been coming from various quarters, logically including competitors for the tender, for some time now. However, the Tax and Customs Administration is said to have ensured that it runs independently within the Netherlands, although concrete evidence of the complete autonomy of the purchased system is not yet available.</p><p>The alternative would have been SAPTRM from SAP, implemented by Capgemini, which is well known to the tax authorities. A 2022 report by McKinsey compared this solution with that of FAST Enterprises, but it is now offline. In it, the latter solution, which was ultimately chosen, would have emerged as the winner.</p><p>According to the ICT Assessment Advisory Board, the preparations for this transition were insufficient in <a href=\"https://www.adviescollegeicttoetsing.nl/documenten/2024/04/02/bit-advies-modernisering-omzetbelasting\" target=\"_blank\">April 2024</a>. The management was said to have been too weak, the need for the solution insufficiently clear, and above all, the preparation for the decision-making process was deemed ‘insufficiently careful’. In <a href=\"https://uitspraken.rechtspraak.nl/details?id=ECLI:NL:RBDHA:2025:3645\" target=\"_blank\">March 2025</a>, the court ruled that the award to FAST was justified after Capgemini had filed a lawsuit.</p><p>The acquisition of Solvinity by the American company Kyndryl sparked the controversy surrounding digital sovereignty at the beginning of this year. Because <a href=\"https://www.techzine.eu/news/privacy-compliance/138159/regulator-investigates-kyndryls-acquisition-of-dutch-solvinity/\">Solvinity</a> manages the DigiD system for civil affairs on behalf of the government, dependence on the United States via the former IBM component Kyndryl would be risky. Exactly how much control Washington has is unclear, especially since the outsourcing of DigiD may eventually be relocated.</p><p>In short, what is now happening with FAST Enterprises seems to be repeating the controversy surrounding Solvinity. Although the details are completely different, the importance of the government’s digital autonomy remains at stake. The expressed concerns about decision-making and the lack of transparency about the exact control exercised by the Tax and Customs Administration make the issue highly debatable. This is clear even without the knowledge of 2026.</p>","contentLength":3452,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1rhr0lt/dutch_tax_authority_hands_us_software_company/"},{"title":"Germany’s AfD sparks fears it is helping Russia with inquiry on NATO weaknesses","url":"https://www.politico.eu/article/afd-inquiry-nato-vulnerabilities-hedgehog-2025-estonia-raises-intelligence-fears/","date":1772342709,"author":"/u/andrewgrabowski","guid":346,"unread":true,"content":"<div><p>“This isn’t a political quarrel. We have a real problem in the requirement profile. And if we can’t solve that, then we can’t maintain the project,” says German chancellor.</p></div>","contentLength":182,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1rhow9u/germanys_afd_sparks_fears_it_is_helping_russia/"},{"title":"Italy's defence minister stuck in Dubai with family","url":"https://www.reuters.com/world/middle-east/italys-defence-minister-stuck-dubai-with-family-2026-02-28/","date":1772341025,"author":"/u/Just-Sale-7015","guid":339,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1rhocij/italys_defence_minister_stuck_in_dubai_with_family/"},{"title":"Belgian Armed Forces Board and Seize Russian Shadow Fleet Oil Tanker","url":"https://www.hln.be/buitenland/belgisch-leger-entert-olietanker-van-russische-schaduwvloot~a10abde2/","date":1772329996,"author":"/u/BelgianPolitics","guid":348,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1rhkn82/belgian_armed_forces_board_and_seize_russian/"},{"title":"Yanis Varoufakis calls prosecution after admitting taking ecstasy 40 years ago ‘ridiculous’","url":"https://www.theguardian.com/world/2026/feb/28/yanis-varoufakis-calls-prosecution-after-admitting-taking-ecstasy-40-years-ago-ridiculous","date":1772322083,"author":"/u/Aschebescher","guid":344,"unread":true,"content":"<p>Yanis Varoufakis, the leftwing firebrand who briefly served as Greece’s finance minister, has criticised his “ridiculous prosecution” for allegedly promoting the use of recreational drugs after his public admission that he once took an ecstasy pill almost 40 years ago.</p><p>The 64-year-old, who reminisced about the experience on a podcast, was charged on Wednesday with “inciting others in the illegal use of narcotics”. If convicted he faces a prison term of at least six months and up to €50,000 (£44,000) in fines. A court hearing has been scheduled for December.</p><p>On Friday, Varoufakis described the indictment as indicative of the far-right turn in politics across the west.</p><p>“My ridiculous prosecution must be seen within the wider, west-wide surge of an insidious new form of fascism,” he wrote on X, highlighting what he claimed was the appointment of “neo-fascists” to top posts in the centre-right Greek government.</p><p>“In this context, I am honoured by their determination to persecute me – as it grants me the privilege of calling upon people of good conscience, from around the world, to stand together, to oppose them.”</p><p>He accused Greece’s prime minister, Kyriakos Mitsotakis of “cutting a deal” with the far right to ensure that, unlike elsewhere in Europe, extremists did not form their own party. In prominent ministerial positions, he said, they were then able to “use their authority to appeal to their electoral base by ensuring … that people like myself are harassed and dragged through the courts”.</p><p>Varoufakis, an economics professor widely seen on the European left as Greece’s most vociferous public intellectual, spoke candidly about his own brush with drugs on the podcast in January. Although his small leftwing party, MeRA25, narrowly failed to cross the threshold into parliament in elections in June 2023, he holds particular appeal among young voters disillusioned with mainstream politics.</p><p>Asked if he had ever used drugs, he recalled an incident in Sydney in 1989 when, after a Mardi Gras parade, he had taken ecstasy during a Kylie Minogue concert. “I’m not like Bill Clinton who ‘did not inhale’. I inhaled,” he said. “I took ecstasy once. It was an amazing experience until a few days later when I had an incredible migraine … I remember dancing 15 to 16 hours, as if nothing had happened, but then I suffered for a week and never took it again.”</p><p>He went on to admit that he was still partial to “grass, but I can’t find it, and no one will give it to me”.</p><p>Critics, including TV show hosts, lashed out at the politician, accusing him of abusing his status as a role model. However, he is not the first public figure in Greece to have spoken out about recreational drug use.</p><p>The former mayor of Athens, Kostas Bakoyannis, who is Mitsotakis’s nephew, confessed in a TV interview in 2017 to smoking hashish, adding, with a laugh, that he had felt the urge to do it at family gatherings. Artists and scientists have also spoken publicly about drug use. None, however, have been prosecuted as a result.</p><p>As the row has deepened, so has support for Varoufakis.</p><p>Charalampos Poulopoulos, widely considered Greece’s pre-eminent drug abuse expert, told the Guardian the remarks were not only an expression of opinion and, as such, “a constitutionally guaranteed right”, but fell far short of promoting illegal substances and inciting others to take them.</p><p>“Several times in the past, public figures have talked about their experience with substance use in their youth without it being considered a criminal offence,” said Poulopoulos, now professor of social work in addictions at the University of West Attica. “His comments are clearly being exploited today to cultivate political fear on the basis of a fabricated risk around the spread of drugs. If convicted, he’ll become a hero. This very surprising prosecution neither serves the common good, nor public interest.”</p><p>Until laws were amended more than a decade ago, Greece had some of the toughest anti-drug legislation in Europe. In a society both socially conservative and often late to trends, heavy drug use <a href=\"https://www.theguardian.com/world/2013/may/16/greek-addicts-sisha-drug-crisis\" data-link-name=\"in body link\">arrived</a> with the debt-stricken country’s economic crisis in 2010 when unemployment and poverty began to soar.</p><p>Varoufakis took over as finance minister in 2015 as Greece’s struggle to keep bankruptcy at bay intensified shortly after a radical leftwing government assumed power.</p><p>In a statement MeRA25 vowed to tackle the issue of addiction with “a modern scientific approach and not with gendarmerie-style attitudes from the 1950s”.</p><p>Varoufakis has, meanwhile, pledged to continue speaking the language of truth in a society he claims is awash with “hypocrisy and cocaine”.</p>","contentLength":4728,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1rhhpw2/yanis_varoufakis_calls_prosecution_after/"}],"tags":["news"]}