{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Former Iranian president Mahmoud Ahmadinejad reported assassinated","url":"https://www.ynetnews.com/article/b1hymtzt11g","date":1772375344,"author":"/u/Sensitive_Echo5058","guid":336,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1rhymzb/former_iranian_president_mahmoud_ahmadinejad/"},{"title":"First oil tanker attacked in the Strait of Hormuz according to Oman","url":"https://www.euronews.com/business/2026/03/01/first-oil-tanker-attacked-in-the-strait-of-hormuz-according-to-oman","date":1772368389,"author":"/u/Force_Hammer","guid":333,"unread":true,"content":"<p>The first attack against a ship in the Strait of Hormuz occurred on Sunday morning. </p><p>Oman's Maritime Security Centre announced that an oil tanker named Skylight, flying the flag of the Republic of Palau, was targeted around five nautical miles (9.26km) north of Khasab Port.</p><p>In a statement shared on X, Oman authorities confirmed that there were 20 crew members on board, including 15 holding Indian nationality and 5 of Iranian nationality, and they were all evacuated.</p><p>Preliminary information also indicates that at least four people were injured and have been transferred to receive medical treatment.</p><p>It has not been specified who attacked or what hit the vessel, but the incident follows the declaration from Iran's Islamic Revolutionary Guard Corps (IRGC) that the Strait of Hormuz is closed to international navigation, on Saturday.</p><p>The Palau-flagged oil tanker is reportedly under US sanctions.</p><p>Oman authorities also stated that the port of Duqm was targeted by a drone attack. </p><p>The country was serving as a mediator between Tehran and Washington in recent nuclear talks.</p><p>Following the US and Israeli strikes on Iran, which killed Supreme Leader Ayatollah Ali Khamenei and prompted Iranian missile retaliation, the IRGC issued radio warnings declaring the Strait of Hormuz effectively closed, stating no ships are allowed to pass.</p><p>While Tehran has not made a formal announcement of a full blockade, the threats have triggered immediate disruption. Ship traffic has plummeted with vessels holding outside the Gulf of Oman or executing U-turns mid-transit.</p><p>Most major shipowners and operators have suspended operations through the Strait of Hormuz. Namely, the Danish shipping and logistics giant, Maersk, has suspended all future transits through the Strait of Hormuz until further notice, on Sunday afternoon.</p><p>Marine insurers have also halted coverage for any voyages in the area, leaving transporters exposed to massive risk premiums or outright refusal. </p><p>Specific examples include the very large crude carrier KHK Empress, partially loaded with Omani crude, and the Desh Abhimaan sailing under the flag of India, both of which turned back.</p><p>Oil futures reopen for trading this Sunday evening amid widespread talk of Brent crude hitting $100 per barrel, levels last seen after Russia’s invasion of Ukraine in 2022.</p><p>Analysts at Barclays, among other firms, have explicitly raised forecasts to that threshold, warning that a prolonged halt could block up to 20 million barrels per day, which represents about 20% of global supply.</p><p>Eight OPEC+ countries, Saudi Arabia, Russia, Iraq, UAE, Kuwait, Kazakhstan, Algeria and Oman, met virtually on Sunday, to review global market conditions and outlook.</p><p>In a press release, they announced a small increase of oil output by 206,000 barrels per day starting in April. </p><p>The statement also informed that the eight OPEC+ countries will \"hold monthly meetings to review market conditions, conformity and compensation\" with the next conference scheduled for 5 April.</p><p>No kinetic Iranian naval blockade has materialised yet, but the practical shutdown and insurance void have created extreme volatility. </p><p>Ship tracking monitors show the large majority of traffic stalled on either side, and any further escalation or de-escalation will dictate the market reaction.</p>","contentLength":3288,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1rhw699/first_oil_tanker_attacked_in_the_strait_of_hormuz/"},{"title":"US and Israel clash with Iran at emergency Security Council meeting. UN chief condemns attacks","url":"https://apnews.com/article/iran-israel-us-un-security-council-airstrikes-9140bca9241fb99be8cb3cff2c650741","date":1772336866,"author":"/u/Expensive-Horse5538","guid":329,"unread":true,"content":"<p>UNITED NATIONS (AP) — The United States and Israel clashed with Iran at an emergency meeting of the U.N. Security Council on Saturday where the U.N. chief and many countries urged a halt to  and a return to negotiations to prevent the conflict from spreading further into the region and beyond.</p><p>Secretary-General António Guterres told the council that everything must be done to prevent an escalation. “The alternative,” he warned, “is a potential wider conflict with grave consequences for civilians and regional stability.”</p><p>Guterres said the U.S. and Israeli airstrikes violated international law, including the U.N. Charter. He also condemned Iran’s retaliatory attacks for violating the sovereignty and territorial integrity of Bahrain, Iraq, Jordan, Kuwait, Qatar, Saudi Arabia and the United Arab Emirates.</p><p>The U.S. ambassador to the United Nations, Mike Waltz, insisted the U.S. military action was lawful. </p><p>“Iran cannot have a nuclear weapon,” he told the council. “That principle is not a matter of politics. It’s a matter of global security. And to that end, the United States is taking lawful actions.”</p><p>Israel’s U.N. Ambassador Danny Danon defended the airstrikes as necessary to stop an existential threat.</p><p>“We are stopping extremism before it becomes unstoppable,” he said. “We will ensure that no radical regime armed with nuclear weapons and ballistic missiles can threaten our people or the entire world.”</p><p>Amir Saeid Iravani, Iran’s ambassador to the U.N., told the council that the airstrikes have killed and injured hundreds of Iranian civilians, which he called a war crime and a crime against humanity. </p><p>He blasted the U.N. and the Security Council, its most powerful body, for not heeding Tehran’s warnings about the “warmongering statements” by the U.S. in recent weeks and urged the council to act now.</p><p>“The issue before the council is straightforward: whether any member state may, including a permanent member of this council, through the use of force, coercion or aggression, determine the political future or system of another state or impose control over its affairs,” Iravani said.</p><p>During his speech, the Iranian diplomat did not mention or comment on President Donald Trump’s statement that Supreme Leader Ayatollah  was killed in the strikes, although Iranian state media later confirmed his death. The assassination of the second leader of the Islamic Republic, who had no designated successor, raised the prospects of a protracted conflict given Iranian threats of retaliation. </p><h2>Iranian and US ambassadors have tense back-and-forth</h2><p>In a rare exchange, the U.S. and Iranian ambassadors traded warnings and direct rebuffs toward the end of the emergency session as military aggression between their countries risked spilling into a regional war.</p><p>After Waltz responded to Iranian claims that the U.S. had violated international law, Iravani asked to speak again to issue a warning: “I advise to the representative of the United States to be polite. It will be better for yourself and the country you represent.”</p><p>Waltz responded immediately, saying, “This representative sits here, in this body, representing a regime that has killed tens of thousands of its own people, and imprisoned many more, simply for wanting freedom from your entire tyranny.”</p><h2>Other Security Council members speak up</h2><p>Russia’s ambassador condemned the U.S.-Israeli airstrikes, while China’s ambassador was more measured in his criticism. </p><p>“We demand that the United States and Israel immediately cease their aggressive actions,” Russian U.N. Ambassador Vassily Nebenzia said. “We insist on the immediate resumption of political and diplomatic settlement efforts … based on international law, mutual respect and a balance of interests.”</p><p>China’s U.N. Ambassador Fu Cong said China was very concerned by “the sudden escalation of regional tensions” and supported Russia’s call for a return to diplomatic negotiations. </p><p>The permanent observer of the 22-nation Arab League, Maged Abdelaziz, suggested Israel was being hypocritical in justifying its military attack by saying it was intended to prevent Iran from acquiring nuclear weapons. Abdelaziz, a former Egyptian ambassador to the U.N., noted that Israel has refused to subject its own nuclear facilities to inspection by the U.N. nuclear watchdog. </p><p>The emergency meeting was called by five council members: Bahrain, which is the Arab representative on the council, France, Russia, China and Colombia,.</p><p>In a joint statement, the leaders of Britain and France — both veto-wielding members of the council — along with Germany’s chancellor called for a resumption of U.S.-Iranian talks on Tehran’s nuclear program. The three countries, part of the 2015 nuclear deal with Iran, have led efforts to reach a negotiated solution. Trump pulled the U.S. out of the deal in 2018.</p><p>The three European leaders strongly condemned Iranian airstrikes in the region — not the U.S.-Israeli airstrikes — and urged Iran’s leaders to seek a negotiated solution, saying: “Ultimately, the Iranian people must be allowed to determine their future.”</p><p>The Security Council meeting is taking place on the last day of the United Kingdom’s presidency and a day before the United States takes over the rotating presidency for the month of March.</p><p>Amiri reported from Atlanta.</p>","contentLength":5368,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1rhn05f/us_and_israel_clash_with_iran_at_emergency/"},{"title":"IRGC says 'most intense' operation against Israel and US will begin soon","url":"https://www.ynetnews.com/article/rjkknqbf11l","date":1772336087,"author":"/u/Mongoose-Additional","guid":335,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1rhmr0j/irgc_says_most_intense_operation_against_israel/"},{"title":"Iranian state media say country's supreme leader is dead","url":"https://apnews.com/article/iran-us-explosion-tehran-c2f11247d8a66e36929266f2c557a54c","date":1772329376,"author":"/u/BarbaricOklahoma","guid":337,"unread":true,"content":"<p>DUBAI, United Arab Emirates (AP) — Iranian Supreme Leader  was killed in a major attack by Israel and the United States, Iranian state media confirmed early Sunday, throwing the future of  into doubt and raising the risk of regional instability. </p><p>President  announced the death hours earlier, saying it gave Iranians their “greatest chance” to “take back” their country.</p><p>State media reported that the 86-year-old was killed in an airstrike targeting his compound in downtown Tehran. Satellite photos from Airbus showed that the site was heavily bombed. </p><p>His death at his office “showed that he consistently stood among the people and at the forefront of his responsibilities, confronting what officials call global arrogance,” state TV said. </p><p>“Khamenei, one of the most evil people in History, is dead,” Trump wrote in a social media post. He warned of “heavy and pinpoint bombing” that he said would continue throughout the week and even beyond, part of a lethal assault the U.S. has justified as necessary to disable .</p><p>Iran, which responded to the strikes with its own counterassault, warned of retribution, with the Cabinet saying that this “great crime will never go unanswered.” The paramilitary Revolutionary Guard threatened to launch its “most intense offensive operation” ever targeting Israeli and American bases.</p><p>The killing of Khamenei in  on Iran in eight months appeared certain to create a leadership vacuum given the absence of a known successor and because  had final say on all major policies during his decades in power. He led Iran’s clerical establishment and the Revolutionary Guard, the two main centers of power in the governing theocracy.</p><p>Iran quickly formed a council to govern the country until a new supreme leader is chosen.</p><p>State media also reported the deaths of the head of Iran’s Revolutionary Guard and a top security adviser to Khamenei in airstrikes. Maj. Gen. Mohammad Pakpour took over as the Guard’s top commander after Israel killed its past commander in the 12-day war last June. The adviser, Ali Shamkhani, had long been a figurehead within Iran’s security establishment, IRNA said.</p><p>As reports trickled out about Khamenei’s death, eyewitnesses in Tehran told The Associated Press that some residents were rejoicing, cheering from rooftops, blowing whistles and letting out ululations.</p><p>Mourners raised a black mourning flag over the Imam Reza shrine in Mashhad, Iran’s second-largest city and a major pilgrimage site for Shiite Muslims. The Iranian government declared 40 days of public mourning and a seven-day nationwide public holiday to commemorate Khamenei’s death.</p><p>Citing unidentified sources, the semiofficial Fars news agency, believed to be close to the Revolutionary Guard, reported that several relatives of Khamenei were also killed, including a daughter, son-in-law, daughter-in-law and grandchild.</p><h2>Strikes were planned for months</h2><p>The joint U.S.-Israel operation, which officials say was planned for months, took place Saturday during the Muslim holy fasting  and at the start of the Iranian workweek. It followed stilted negotiations and warnings from Trump, who last year trumpeted his administration’s success in incapacitating the country’s nuclear program but nonetheless cast the latest round as necessary to head off its potential resurgence.</p><p>About 12 hours after the attacks began, the U.S. military reported no U.S. casualties and minimal damage at U.S. bases despite “hundreds of Iranian missile and drone attacks.” It said targets in Iran included Revolutionary Guard command facilities, air defense systems, missile and drone launch sites, and military airfields.</p><p>Israel, for its part, said it had killed the commander of the Revolutionary Guard Corps and the country’s defense minister, as well as the secretary of the Iranian Security Council, a close adviser to Khamenei.</p><p>Khamenei “was unable to avoid our Intelligence and Highly Sophisticated Tracking Systems and, working closely with Israel, there was not a thing he, or the other leaders that have been killed along with him, could do,” Trump said. “This is the single greatest chance for the Iranian people to take back their Country.”</p><p>An Iranian diplomat  that hundreds of civilians were killed and wounded in the strikes. Iran retaliated by firing missiles and drones toward Israel and at U.S. military bases in the region, and exchanges of fire continued into the night.</p><p>Some of  on Iran appeared to hit near the offices of Khamenei, the second leader of the Islamic Republic who succeeded Ayatollah Ruhollah Khomeini, the leader of the 1979 Islamic Revolution. Israeli officials confirmed the death, followed by Trump.</p><p>Democrats decried that Trump had taken . White House spokesperson Karoline Leavitt said the administration had briefed several Republican and Democratic leaders in Congress in advance.</p><div data-align-center=\"\" data-video-orientation=\"landscape\"><div><div><div><p>U.S. President Donald Trump urged the Iranian people to “take over your government” in a video address posted Saturday. His comments came after the U.S. and Israel launched an attack on Iran.</p></div></div></div></div><h2>Tensions soared as US built up military forces</h2><p>Though Trump had pronounced the Iranian nuclear program obliterated in strikes last year, the country was rebuilding infrastructure that it had lost, according to a senior U.S. official who spoke to reporters on condition of anonymity to discuss Trump’s decision-making process. The official said intelligence showed that Iran had developed the capability to produce its own high-quality centrifuges, an important step in developing the highly enriched uranium needed for weapons.</p><p>Iran responded to the latest strikes by launching missiles and drones  and targeting U.S. military installations in Bahrain, Kuwait and Qatar. The Israeli military said Iran fired dozens of missiles at Israel, with many intercepted. The Magen David Adom rescue service said Saturday night that a woman in the Tel Aviv area died after being wounded in an Iranian missile attack.</p><p>At least three explosions were heard Saturday evening near the Intelligence Ministry building in northern Tehran, witnesses said, adding that air defense systems had begun operating there. Israel’s military said it had begun new strikes against missile launchers and aerial defense systems in central Iran.</p><p>In southern Iran, at least 115 people were reported killed when a girls’ school was struck, and dozens more were wounded, the local governor told Iranian state TV. U.S. Central Command spokesperson Capt. Tim Hawkins said he was “aware of reports” that a girls’ school was struck and that officials were looking into them.</p><p>Iran’s state news agency IRNA said at least 15 people were killed in the southwest, quoting the governor of the Lamerd region, Ali Alizadeh, as saying a sports hall, two residential areas and a hall near a school were hit.</p><p>Flights across the Middle East were , and air defense fire thudded over Dubai, the United Arab Emirates’ commercial capital. Shrapnel from an Iranian missile attack on the UAE capital killed one person, state media said. </p><h2>Attack was coordinated between Israel and US</h2><p>Israel said the operation had been planned for months with the United States. Air Force pilots struck “hundreds of targets across Iran,” Israeli military chief of staff Lt. Gen. Eyal Zamir said in a statement.</p><p>Targets in the Israeli campaign included Iran’s military, symbols of government and intelligence targets, according to an official briefed on the operation, who spoke on condition of anonymity to discuss nonpublic information on the attack.</p><p>Trump acknowledged Saturday that there could be American casualties, saying “that often happens in war.” He said he was aiming to “annihilate” the Iranian navy and destroy regional proxies supported by Tehran. He called on the paramilitary  to lay down arms, saying members would be given immunity or face “certain death” if they did not.</p><p>Iran had said it hoped to avert a war, but it maintained its right to enrich uranium. </p><p>Trump had threatened military action but held off following Iran’s recent crackdown on protests spurred by economic grievances that evolved into a nationwide push against the ruling clerics.</p><p>The Human Rights Activists News Agency says it confirmed  in the crackdown and is investigating thousands more. The government has acknowledged more than 3,000 killed.</p><h2>Effects could extend to markets and other countries </h2><p>The strikes could rattle global markets, particularly if Iran makes the Strait of Hormuz unsafe for commercial traffic. A third of worldwide  transported by sea passed through the strait in 2025.</p><p>Saudi Arabia said Iran targeted its capital and eastern region in an attack that was repelled. Bahrain said a missile attack targeted the U.S. Navy’s 5th Fleet headquarters in the island kingdom, and three buildings were damaged in the capital, Manama, and Muharraq city by drone strikes and debris from an intercepted missile.</p><p>Kuwait’s civil aviation authority said a drone targeted the main international airport, injuring several employees. Kuwait’s state-run news agency said three troops were injured by shrapnel from strikes that hit Ali Al-Salem air base. Explosions could also be heard in Qatar. Jordan said it “dealt with” 49 drones and ballistic missiles.</p><p>Lidman reported from in Tel Aviv. Boak reported from West Palm Beach, Florida. Tucker reported from Washington. Associated Press reporters Joe Federman in Jerusalem, Aamer Madhani and Konstantin Toropin in Washington, Sam Mednick in Tel Aviv, Farnoush Amiri in New York and AP journalists around the world contributed to this report.</p><p>This story has been corrected to show that the IRNA news agency reported 40 people were killed in the school strike, without specifying students.</p>","contentLength":9751,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1rhkfgy/iranian_state_media_say_countrys_supreme_leader/"},{"title":"Canada supports U.S. actions in destroying Iran's nuclear program, Carney says","url":"https://www.cbc.ca/news/politics/canada-carney-us-attack-trump-iran-nuclear-weapon-9.7109886","date":1772326772,"author":"/u/Arcool_1","guid":332,"unread":true,"content":"<p>As U.S. President Donald Trump charges ahead with a major attack on Iran, Prime Minister Mark Carney says Canada supports at least one component of the American mission: destroying Iran's nuclear program.</p><p>\"Canada supports the United States acting to prevent Iran from obtaining a nuclear weapon and to prevent its regime from threatening international peace and security,\" Carney said in a speech at the Canada-India Growth and Investment Forum in Mumbai on Saturday.</p><p>\"Canada's position remains clear: The Islamic Republic of Iran is the principal source of instability and terror throughout the Middle East, has one of the world's worst human rights records and must never be allowed to obtain or develop nuclear weapons.\"</p><p>After his speech, Carney said Canada is not participating militarily and that the federal government was \"not party to the military buildup or planning.\"</p><p>The U.S. and Israel launched an attack on Iran on Saturday, with the first apparent strike happening near the offices of Supreme Leader Ayatollah Ali Khamenei.</p><ul><li><em><strong>Are you a Canadian in the Middle East who is considering leaving after military strikes by the U.S. and Israel on Iran? We want to hear from you. Send an email to</strong></em><a href=\"mailto:ask@cbc.ca\" target=\"_blank\"></a></li></ul><p>Soon after the attack began, Trump <a href=\"https://truthsocial.com/@realDonaldTrump/posts/116147082884192486\" target=\"_blank\"><u>released a video on social media </u></a>declaring that the objective of the U.S. \"is to defend the American people by eliminating imminent threats from the Iranian regime.\"</p><p>\"It has always been the policy of the United States, in particular my administration, that this terrorist regime can never have a nuclear weapon.\"</p><p>Trump claimed that Iran has continued to develop its nuclear program and plans to develop missiles to reach the United States. He also appealed to the Iranian people to \"take over your government — it will be yours to take.\"</p><div><em><strong>WATCH | Carney backs U.S. action against Iran's nuclear program:</strong></em></div><p>Trump acknowledged that there could be American casualties following strikes by Iran, saying \"that often happens in war.\"</p><p>Iran hit back at Israel and several Gulf countries with U.S. military bases, which Canadian Foreign Affairs Minister Anita Anand condemned.</p><p>\"We strongly condemns the attacks of the Iranian regime against our partners in the Middle East,\" she said in a statement. \"These attacks must stop.\"</p><p>Conservative Leader Pierre Poilievre said on social media his party supports \"the courageous people of Iran in toppling this terror regime and reclaiming their destiny after 47 years of the regime's occupation.\"</p><p>\"Conservatives support a democratic, free and permanently-denuclearized Iran that lives in peace and security with its neighbours. And Conservatives support the United States, Israel, and our allies across the Gulf to defend their sovereignty and dismantle the clerical military dictatorship of Iran,\" Poilievre said.</p><p>Bloc Québécois Leader Yves-Francois Blanchet <a href=\"https://x.com/yfblanchet/status/2027799513130488159\">said on social media in French</a> that his party \"recognizes the persistent threat posed by the Iranian regime to the security of the region and the freedom of Iranians,\" but has concerns the U.S. is using military force without the approval of Congress.</p><p>\"Such endorsement of the attacks thus appears premature: both Donald Trump and the Iranian regime show a lack of regard for civilian lives, international law must prevail, and negotiation as well as sanctions remain the preferred paths,\" Blanchet said.</p><p>Other federal leaders, including interim NDP Leader Don Davies and Green Party Leader Elizabeth May have not yet commented on the attack.</p><p>But NDP foreign affairs critic Alexandre Boulerice said in a statement the party \"strongly condemns the American and Israeli bombings of Iran. This is a dangerous escalation that risks dragging the entire region into a major conflict.\"</p><p>He added: \"The NDP deplores the Carney government's decision to blindly support this dangerous venture by Israel and Donald Trump's administration. We want Canada to be a voice for diplomacy, peace, and international law.\"</p>","contentLength":3912,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1rhjhx0/canada_supports_us_actions_in_destroying_irans/"},{"title":"Australia 'did not participate' in Operation Epic Fury in Iran","url":"https://www.abc.net.au/news/2026-03-01/australia-not-involved-iran-operation-epic-fury/106401742","date":1772320841,"author":"/u/Expensive-Horse5538","guid":330,"unread":true,"content":"<p>Foreign Minister Penny Wong has confirmed Australia was not involved in the major Israeli-United States operation in Iran that has decapitated its leadership.</p><p>Senator Wong also confirmed Australia was not told in advance of Operation Epic Fury.</p><p>\"Obviously, we did not participate in the strikes and you would not expect us to participate,\" she said.</p><p>The minister refused to comment on whether Australian intelligence contributed to the operation \"as a general proposition\".</p><p>\"These are strikes which are determined by the parties concerned, which is the United States and Israel,\" she said.</p><p>Senator Wong urged the resumption of dialogue and diplomacy, which had been underway until the surprise attack.</p><p>Following a meeting of the National Security Committee of Cabinet this morning, the government is urgently seeking to confirm whether any Australians have been affected.</p><p>Official travel advice has been upgraded with Australians warned not to travel to Israel, Lebanon, Bahrain, Kuwait, Qatar and the United Arab Emirates.</p><p>Prime Minister Anthony Albanese said the foreign department was registering names of people seeking to depart Israel and Iran, though he noted that capacity to help people inside Iran was restricted.</p><p>Mr Albanese expressed his hope for the people of Iran, and concerns over regional escalation.</p><p>\"When Iranians went out on the street to demand their human rights … we saw the [Islamic Revolutionary Guard Corps] crack down brutally, thousands murdered,\" he said.</p><p>\"This is a regime that — we hope that the Iranian people are able to determine their own destiny.\"</p><figure data-print=\"inline-media\" data-component=\"Figure\" data-uri=\"coremedia://imageproxy/106402204\"><div><figcaption data-component=\"Figure__figcaption\"><p data-component=\"Typography\">Prime Minister Anthony Albanese expressed his hopes for the people of Iran after a major operation against the Iranian regime.</p></figcaption></div></figure><p>The prime minister urged a swift resolution to the attack.</p><h2 data-component=\"Heading\">Khamenei's death 'won't be mourned'</h2><p>Iranian state media has confirmed that its Supreme Leader Ayatollah Ali Khamenei was killed in the attack, with Israel also claiming the deaths of other Iranian defence leaders.</p><p>Mr Albanese said the Ayatollah would not be mourned.</p><p>\"He is responsible for orchestrating attacks on Australian soil. His passing will not be mourned,\" Mr Albanese said.</p><p>Shadow Treasurer Tim Wilson told ABC Insiders that he did not want the situation to escalate further, but the death of the ayatollah was welcome.</p><p>\"The ayatollah is dead and that means the world is now a safer place,\" Mr Wilson said.</p><p>Andrew Hastie, a former SAS soldier and former assistant defence minister, said Mr Trump was an \"apex opportunist\" who strikes when an opportunity is presented.</p><p>Mr Hastie told Sky News the president was \"setting the conditions for regime change in Iran\", but he believed that toppling the regime would be left to Iranians.</p><p>\"It's a massive call, but given the restraining impulse of people in his administration like Vice President [J.D.] Vance there was never a prospect of boots in the ground,\" Mr Hastie said.</p><p>\"We saw what he did in Venezuela, in and out ... we saw what happened in Iran last year, sending those bombers to hit the three nuclear facilities, I suspect this will look more of the same. Let's see what happens.</p><p>\"As a veteran of the so-called 'forever wars' I am very suspicious about regime change by force, but Iran is a terrible regime, they are a proxy, they are underwritten by Chinese and Russian tech.\"</p>","contentLength":3291,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1rhh8l4/australia_did_not_participate_in_operation_epic/"},{"title":"Hezbollah condemns strikes on Iran but stops short of pledging to attack Israel","url":"https://www.timesofisrael.com/hezbollah-condemns-strikes-on-iran-but-stops-short-of-pledging-to-attack-israel/","date":1772313661,"author":"/u/StealthCuttlefish","guid":331,"unread":true,"content":"<p>Lebanon’s Iran-backed Hezbollah terror group called on Saturday for the Middle East to stand against Israel and the US after they launched a joint military offensive against Iran, after long weeks of escalating regional tensions and burgeoning threats of conflict.</p><p>Hezbollah condemned the “American-Israeli hostilities against the Islamic Republic,” but stopped short of pledging to retaliate against Israel, amid fears that it could become involved in the conflict.</p><p>The Lebanese terrorist organization also did not intervene in the 12-day war between Israel and Iran last June, which the US briefly joined.</p><p>“We call on countries and people of the region to stand strong in the face of these hostile designs,” Hezbollah said in a statement, warning that “its dire consequences will affect everyone without exception if left unchecked.”</p><p>“We’re certain that the American-Israeli enemy will be dealt a major blow, and reap nothing but failure from its criminal, tyrannical aggression,” Hezbollah added.</p><p>Hezbollah leader Naim Qassem was scheduled to make a televised speech later Saturday, but it was subsequently postponed.</p><p>The statement came after a Hezbollah official had told AFP this week that it would not intervene militarily in the event of “limited” US strikes, but would consider any attack against Supreme Leader Ayatollah Ali Khamenei a “red line.” Khamenei was among the senior Iranian officials targeted in the initial strikes.</p><p>Before the operation against Iran began, Israel launched a wave of airstrikes on Hezbollah targets — including tunnel shafts and rocket launching sites — across southern Lebanon on Saturday morning.</p><p>According to the Israel Defense Forces, Hezbollah was recently working to restore its military capabilities at the targeted sites in order to advance attacks on Israel.</p><p>“This activity constitutes a violation of the understandings between Israel and Lebanon and a threat to the State of Israel,” the IDF said.</p><p>Lebanon’s state-run National News Agency reported that the Israeli strikes targeted mountainous areas in the south where Hezbollah has a strong presence.</p><p>Earlier Saturday, Lebanese Prime Minister Nawaf Salam earlier in the day saying that Lebanon refused to be dragged into war.</p><p>“I reiterate that we will not accept anyone dragging the country into adventures that threaten its security and unity,” Salam said on X.</p><p>“In light of the serious developments unfolding in the region, I once again call on all Lebanese to act with wisdom and patriotism, placing Lebanon and the Lebanese people’s interests above any other consideration,” he added.</p><p>Salam later said his government was making diplomatic contacts to avoid any “repercussions” of the conflict.</p><p>At the same time, US Ambassador to Lebanon Michel Issa told Lebanese President Joseph Aoun that Israel will not escalate against Lebanon if it refrains from hostile actions.</p><p>Aoun stressed that “sparing Lebanon the disasters and horrors of external conflicts, and preserving its sovereignty, security and stability, are an absolute priority.”</p><p>Many airlines, meanwhile, announced the cancellation of their flights to airports in the Middle East, including Beirut.</p><p>Salam, however, said Beirut’s “airport remains open” and that “the national carrier’s flights are continuing.”</p><p>In a post on X, United Nations special coordinator for Lebanon Jeanine Hennis-Plasschaert urged “all parties in Lebanon” to “prioritize, in words and actions, the need to shield the country and its people from unfolding regional developments.”</p>","contentLength":3570,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1rhedzn/hezbollah_condemns_strikes_on_iran_but_stops/"},{"title":"Iranian leader Khamenei killed in strike, Israeli officials say","url":"https://www.ynetnews.com/article/skie4tef11x","date":1772307618,"author":"/u/TheDetectiveDoctor","guid":338,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1rhbvdu/iranian_leader_khamenei_killed_in_strike_israeli/"},{"title":"Prior to Iran attacks, CIA assessed Khamenei would be replaced by hardline IRGC elements if killed, sources say","url":"https://www.reuters.com/world/middle-east/prior-iran-attacks-cia-assessed-khamenei-would-be-replaced-by-hardline-irgc-2026-02-28/","date":1772301495,"author":"/u/DoremusJessup","guid":334,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1rh98gv/prior_to_iran_attacks_cia_assessed_khamenei_would/"}],"tags":["news"]}