{"id":"B69zEhWZA8UEAMn3PhHgwARc5WGncWEYFkmfHhvUDpmmwCTb86SBbpJu5kTKr3v5o6YroQ4Jppnm6fedJCpugi5bapSjXoyoyyG3MW46","title":"DevConf","displayTitle":"Podcast - DevConfs","url":"https://www.youtube.com/feeds/videos.xml?channel_id=UCmYAQDZIQGm_kPvemBc_qwg","feedLink":"https://www.youtube.com/channel/UCmYAQDZIQGm_kPvemBc_qwg","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":15,"items":[{"title":"DevOps at LLM Speed: Using an AI Copilot for Kubernetes and Jenkins - DevConf.IN 2026","url":"https://www.youtube.com/watch?v=p4CUuT9qlik","date":1771671497,"author":"DevConf","guid":635,"unread":true,"content":"<article>Title:  DevOps at LLM Speed: Using an AI Copilot for Kubernetes and Jenkins\n\nSpeaker(s): Karan Jagtiani\n\n---\n\nThis session is a practical, demo-driven walkthrough of how I being a cloud architect use an open source AI copilot called Skyflo.ai to speed up day-to-day DevOps and SRE workflows, without sacrificing safety or compliance. We'll dive into a real incident in a live Kubernetes environment with a Jenkins deployment, where the audience will see the AI agent in action, and how I prompt the agent to triage the incident, decide on the next steps, and act on it. Attendees will see how teams are cutting incident response time by utilizing Skyflo and it's human-in-the-loop approach.\n\nKey Takeaways:\n\n    Learn how I cut down incident response time by 50% at Storylane by using an AI copilot\n    See how to use an AI copilot to speed up your Kubernetes, Argo, Helm, and Jenkins workflows\n    Understand the human-in-the-loop architecture of Skyflo and behind the scenes of how it works\n\n\nLive Demo Plan (70% time):\n1) Trigger a deployment on Jenkins using Skyflo\n2) Wait for the agent to report back with the status of the deployment\n3) The pipeline will succeed, but the deployment in Kubernetes will fail\n4) The agent will go through a process of discovery to find the root cause of the issue\n5) The agent will decide on the next steps and act on it\n\nUnder-the-Hood (30% time):\n\n    Brief Architecture Tour: How LangGraph and MCP are used to power the Skyflo agent\n    Custom MCP Server: kubectl/helm/argo/jenkins with typed parameters and validation\n    Streaming over SSE: Live events over Redis pub/sub and server-sent events over MCP\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":1760,"flags":null,"enclosureUrl":"https://www.youtube.com/v/p4CUuT9qlik?version=3","enclosureMime":"","commentsUrl":null},{"title":"Bridging DevOps and MLOps: Unifying Pipelines with KitOps and GitOps - DevConf.IN 2026","url":"https://www.youtube.com/watch?v=z4xMT-3QZeE","date":1771423085,"author":"DevConf","guid":628,"unread":true,"content":"<article>Title: Bridging DevOps and MLOps: Unifying Pipelines with KitOps and GitOps\n\nSpeaker(s): Neel Shah\n\n---\n\nThis session explores how KitOps seamlessly integrates with GitOps tools such as Flux and ArgoCD to create unified definition processes for native AI workloads. Seriously, Learn how KitOps ModelKits unlocks repeatable packaging of models, code and datasets in any environment while GitOps provides automated, auditable deployment processes. Attendees will see hands-on demonstrations of version-controlled machine learning elements, automatic rollbacks, and environment recovery. Learn how these integrations eliminate configuration drift, enforce consistent audit trails and support compliance with enterprise requirements all with minimal operational overhead. By connecting modern DevOps methods with the rigorous demands of MLOps, this talk will demonstrate how cloud-native AI teams can rapidly deliver reliable, scalable and secure ML solutions.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":1070,"flags":null,"enclosureUrl":"https://www.youtube.com/v/z4xMT-3QZeE?version=3","enclosureMime":"","commentsUrl":null},{"title":"Lost in Silence: Understanding When Screen Readers Don’t Speak Up- DevConf.IN 2026","url":"https://www.youtube.com/watch?v=x2KwuVDGG10","date":1771423085,"author":"DevConf","guid":629,"unread":true,"content":"<article>Title: Lost in Silence: Understanding When Screen Readers Don’t Speak Up\n\nSpeaker(s): Ayushi Midha, Aishwarya Urne\n\n---\nIn the world of digital accessibility, silence is seldom neutral. For users of screen readers, a missing announcement can mean confusion, distrust, or exclusion—yet the issue often remains invisible to most developers and designers. In this talk, we’ll explore how the absence of spoken feedback impacts accessibility, trust, and user experience, particularly for people navigating dynamic web interfaces. Drawing on real-world examples and practical scenarios, we’ll examine the root causes of “silent failures” (such as missing ARIA live regions, improper roles, stale live-region content) and discuss how seemingly minor markup decisions ripple into major accessibility barriers. Attendees will walk away with a clear framework for diagnosing and remedying these silent gaps: from audit strategies and end-user testing through to implementable code patterns, best practices for dynamic announcements, and how to integrate these into your UI/component library workflow. Whether you’re working in React, Web Components, or template-driven apps, you’ll gain actionable insights to ensure your components announce properly, your users feel heard, and your silent UI becomes truly inclusive.\n\n**Key take-aways:**\n\nWhy missing announcements matter: the user-experience impact beyond visual cues\n\nCommon pitfalls in dynamic content, live regions, and state changes\n\nA developer-friendly approach to audit, test, and fix announcement gaps\n\nHow to bake these practices into your component library or design system (for example, your team’s work with PatternFly and a custom theme)\n\nTips for collaboration between developers, UX designers, and accessibility testers to maintain accessibility as your product evolves\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":1959,"flags":null,"enclosureUrl":"https://www.youtube.com/v/x2KwuVDGG10?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Open Source Community Playbook: What Works, What Doesn’t, and Why- DevConf.IN 2026","url":"https://www.youtube.com/watch?v=wAy4mgyX61Q","date":1771423085,"author":"DevConf","guid":630,"unread":true,"content":"<article>Title: The Open Source Community Playbook: What Works, What Doesn’t, and Why\n\nSpeaker(s): Pritesh Kiri\n\n---\nIn this talk, I’ll share a practical playbook for creating and sustaining a healthy open source community, drawn from my experience building projects like LitmusChaos, ToolJet, and ReactPlay. We’ll explore what really drives engagement, how to convert users into contributors, and the key practices that help maintainers avoid burnout while scaling their projects.\nWe’ll also discuss what you should and shouldn’t expect from a community as an open source organization. Setting the right expectations is critical for guiding the community’s growth in a healthy and sustainable direction.\nExpect honest stories, actionable frameworks, and a look at what actually works (and what absolutely doesn’t) when you’re growing an open source community in the real world.\nWhether you’re a maintainer, community manager, or just starting your open source journey, this session will give you tools and patterns you can apply immediately to grow your project and its community.\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":1203,"flags":null,"enclosureUrl":"https://www.youtube.com/v/wAy4mgyX61Q?version=3","enclosureMime":"","commentsUrl":null},{"title":"Self-Healing Pipelines? Resilient Deployments with Hardened Containers - DevConf.IN 2026","url":"https://www.youtube.com/watch?v=vEy7sdX4pGU","date":1771423085,"author":"DevConf","guid":631,"unread":true,"content":"<article>Title: Self-Healing Pipelines? Resilient Deployments with Hardened Containers\n\nSpeaker(s): Rajani Ekunde\n\n---\nIn this session, we will discuss how DevOps teams can design self-healing CI/CD pipelines using hardened Docker images and automated recovery checks. We’ll cover integrating Trivy scans, Cosign signatures, and health-probe triggers into GitOps workflows. You’ll learn how these guardrails prevent misconfigurations, block risky images, and enable reliable rollbacks before incidents escalate. Combining SRE principles with container hardening, we’ll show how automation can make resilience measurable — not mythical.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":748,"flags":null,"enclosureUrl":"https://www.youtube.com/v/vEy7sdX4pGU?version=3","enclosureMime":"","commentsUrl":null},{"title":"The Compute Revolution You’re Ignoring: JavaScript in Science- DevConf.IN 2026","url":"https://www.youtube.com/watch?v=pPjMEzm_R-0","date":1771423085,"author":"DevConf","guid":632,"unread":true,"content":"<article>Title: The Compute Revolution You’re Ignoring: JavaScript in Science\n\nSpeaker(s): Gunj Joshi\n\n---\nWhat if anyone, anywhere, could run scientific code - instantly, from a browser tab? No setup, no downloads, just pure computation. The web is evolving from a platform for apps to a platform for science. In this talk, Gunj Joshi shows how modern JavaScript and stdlib are bringing high-performance numerical computing to billions of devices. From AI models to linear algebra, the browser is becoming the next great compute runtime - open, local, and accessible to all.\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":681,"flags":null,"enclosureUrl":"https://www.youtube.com/v/pPjMEzm_R-0?version=3","enclosureMime":"","commentsUrl":null},{"title":"Scaling ML Pipelines with Feast, Ray and Kubeflow - DevConf.IN 2026","url":"https://www.youtube.com/watch?v=oFEN7a3dqUY","date":1771423085,"author":"DevConf","guid":633,"unread":true,"content":"<article>Title: Scaling ML Pipelines with Feast, Ray and Kubeflow\n\nSpeaker(s): Abhijeet Dhumal, Nikhil Kathole\n\n---\n\nFeature engineering is eating your training time. Data loading is your bottleneck. Sound familiar?\nIf your training jobs crawl, your features take forever to compute, or your pipeline breaks every time you scale, this talk is for you.\n\nIn this session, we’ll show how to turn a slow, file-based ML pipeline into a distributed, production-ready architecture using modern open-source tooling:\n- Feast for feature management\n- Ray for distributed data processing\n- Kubeflow Training Operator for orchestrating distributed training on Kubernetes\n\nWe’ll demonstrate an end-to-end pipeline, powering a Temporal Fusion Transformer trained on 421K rows of Walmart sales data. Using PyTorch DDP across multiple GPUs, how we can cut training time, while hitting 10.5% MAPE (compared to the typical 15–20% industry baseline).\n\nYou’ll see:\n- Faster feature loading using Ray + Feast\n- Raw data flowing through a fully managed feature platform\n- Distributed PyTorch jobs launched and scaled with Kubeflow Training Operator\n- Production inference path powered by Feast’s hybrid storage &amp; compute\n- How Ray transforms feature engineering performance at scale\n- How Feast standardizes feature computation across training &amp; inference\n\nYou’ll leave with a repeatable blueprint for building ML pipelines that scale as your models, data, and teams grow, along with the confidence to adopt these tools in your own production environment.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":1650,"flags":null,"enclosureUrl":"https://www.youtube.com/v/oFEN7a3dqUY?version=3","enclosureMime":"","commentsUrl":null},{"title":"Supercharge Your GitOps with ArgoCD Agent - DevConf.IN 2026","url":"https://www.youtube.com/watch?v=jUmW8X6fv6w","date":1771423085,"author":"DevConf","guid":634,"unread":true,"content":"<article>Title: Supercharge Your GitOps with ArgoCD Agent\n\nSpeaker(s): Anand Kumar Singh, Akhil Nittala\n\n---\n\nGitOps, championed by tools like ArgoCD, has become the de facto standard for modern application deployment. While ArgoCD excels in managing applications within a single Kubernetes cluster, deploying and managing workloads across a fleet of clusters can introduce complexity. This session introduces the ArgoCD Agent, a powerful component designed to simplify and secure multi-cluster GitOps workflows. Modern enterprises run multiple clusters to balance compliance, resilience, and team autonomy across global operations. Attendees will learn what the ArgoCD Agent is, how it addresses challenges in a distributed environment, why it was developed, how it solves the scaling problem and see a live demonstration of it in action. If you manage more than one Kubernetes cluster and use ArgoCD, this talk is for you.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":1029,"flags":null,"enclosureUrl":"https://www.youtube.com/v/jUmW8X6fv6w?version=3","enclosureMime":"","commentsUrl":null},{"title":"MPI Meets Machine Learning: Unlocking PyTorch distributed for scaling AI workloads - DevConf.IN 2026","url":"https://www.youtube.com/watch?v=rzJSJsglFYY","date":1771423084,"author":"DevConf","guid":626,"unread":true,"content":"<article>Title: MPI Meets Machine Learning: Unlocking PyTorch distributed for scaling AI workloads\n\nSpeaker(s): Mansi Agarwal\n\n---\n\nThe world of High-Performance Computing (HPC) and modern deep learning share a core DNA: the demand for near-linear scaling across hundreds of nodes. The core challenges remain the same—managing communication, balancing load, and coordinating resources but the abstractions and tooling are now defined by PyTorch Distributed.\n\nThis talk bridges the gap between traditional HPC paradigms and PyTorch's distributed computing ecosystem, designed specifically for deep learning workloads. We'll explore how familiar HPC concepts like collective operations, point-to-point communication, and process groups, manifest in PyTorch's distributed APIs. We'll discover how PyTorch builds upon battle-tested communication backends (NCCL, Gloo, MPI) while introducing novel primitives optimized for gradient synchronization and model parallelism. We then move beyond basic data parallelism to explore advanced memory-saving techniques like Fully Sharded Data Parallel (FSDP), PyTorch's native answer to memory scaling and touch upon the nascent Tensor and Pipeline Parallelism APIs, demonstrating how these techniques compose to train massive models.\n\nThis session equips you with a comprehensive understanding of PyTorch's distributed architecture and reveals the inner workings of one of the most actively developed areas in modern ML infrastructure. By mapping distributed systems concepts to PyTorch's implementation, you'll see how familiar patterns from parallel computing manifest in PyTorch's ecosystem and where there is still room for innovation and improvement.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":1798,"flags":null,"enclosureUrl":"https://www.youtube.com/v/rzJSJsglFYY?version=3","enclosureMime":"","commentsUrl":null},{"title":"How to attack AI systems (and how to defend them) !!!! - DevConf.IN 2026","url":"https://www.youtube.com/watch?v=pvBiMiIrW3w","date":1771423084,"author":"DevConf","guid":627,"unread":true,"content":"<article>Title: How to attack AI systems (and how to defend them) !!!!\n\nSpeaker(s): Huzaifa Sidhpurwala\n\n---\n\nAI systems today demonstrate impressive capabilities—but they also introduce a rapidly expanding attack surface. Modern machine learning pipelines, from data collection and training to inference, are vulnerable to a wide range of adversarial manipulations. This talk provides a practitioner-focused exploration of how attackers compromise AI systems, using real research and case studies. Equally important, the session outlines defensive strategies grounded in current academic and industry work. \n\nAttendees will leave with a clear, realistic understanding of how adversarial attacks work, what defenses are actually effective today, and how to architect AI systems that remain trustworthy even under adversarial pressure.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":941,"flags":null,"enclosureUrl":"https://www.youtube.com/v/pvBiMiIrW3w?version=3","enclosureMime":"","commentsUrl":null},{"title":"Battery Range Prediction using Federated Learning on Edge","url":"https://www.youtube.com/watch?v=cl9MUQhaAcY","date":1771423083,"author":"DevConf","guid":621,"unread":true,"content":"<article>Title: Battery Range Prediction using Federated Learning on Edge\n\nSpeaker(s): Sagar Sundaray, Vinod Pathangay\n\n---\nAccurate prediction of the battery range of electric vehicles requires periodic update of the prediction model as there are changes in battery parameters with time and variation in driving dynamics. Federated Learning (FL) offers the following two advantages for model update: (1) It aggregates learnings from data patterns of fleet of vehicles to provide a sophisticated model that has been trained on wide range of scenarios. (2) It protects the privacy of the vehicle user without sending raw data to the central repository for model updates. With simulated vehicle data and Flower FL framework, a range prediction solution has been developed in a manner so as to easily port to an embedded edge Texas Instruments platform. The edge component can run as a quality managed (QM) component where as the central model aggregation can run as a containerized application on-prem or cloud where communication is established using gRPC.\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":1160,"flags":null,"enclosureUrl":"https://www.youtube.com/v/cl9MUQhaAcY?version=3","enclosureMime":"","commentsUrl":null},{"title":"Beyond ImagePullBackOff: A Stateless, Secret-less Distributed Registry for Edge - DevConf.IN 2026","url":"https://www.youtube.com/watch?v=b8sYQbqN3dY","date":1771423083,"author":"DevConf","guid":622,"unread":true,"content":"<article>Title: Beyond ImagePullBackOff: A Stateless, Secret-less Distributed Registry for Edge\n\nSpeaker(s): Prasanth Baskar\n\n---\n\nWe have all seen it. Your GitOps tool reports Synced in seconds, but your edge node pods are stuck in ContainerCreating/ImagePullBackOff for minutes... hours. This is not just a low bandwidth problem. it is a fundamental design flaw. We are trying to apply a centralized, cloud-native architecture to a decentralized, distributed-systems problem.\n\nThis leads to slow startups, failed updates even worse pullSecrets on every node create a massive security risk. In this session with Harbor Satellite (subproject of goharbor) we will run a stateless distributed registry along with your container workloads\n\nhttps://github.com/container-registry/harbor-satellite\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":896,"flags":null,"enclosureUrl":"https://www.youtube.com/v/b8sYQbqN3dY?version=3","enclosureMime":"","commentsUrl":null},{"title":"From IaC to InfraOps: Automating Day-2 Operations with Terraform Actions & Ansible - DevConf.IN 2026","url":"https://www.youtube.com/watch?v=_AUUM2GAk9g","date":1771423083,"author":"DevConf","guid":623,"unread":true,"content":"<article>Title: From IaC to InfraOps: Automating Day-2 Operations with Terraform Actions &amp; Ansible\n\nSpeaker(s): Dr. Rahul Gaikwad\n\n---\nInfrastructure as Code has standardized Day-0 provisioning, but most enterprises still handle Day-2 operations patching, configuration changes, drift remediation, and incident response through manual processes and fragmented automation. This session shows how Terraform Actions, combined with the Red Hat Ansible Automation Platform (AAP), transforms Terraform from a provisioning tool into an operational control plane. With Terraform managing infrastructure state and Ansible executing configuration and remediation workflows, teams can unify provisioning and operations into a single, governed workflow. Using the new Terraform action for AAP, a single terraform apply can trigger Event-Driven Ansible (EDA) to execute dynamic automation across Red Hat environments. The result is a repeatable, policy-driven model for Day-2 operations that reduces operational friction, eliminates ad-hoc access, and improves reliability at scale.\n\n**Target Audience:** Developers, Architects, DevOps, Security, SRE\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":1242,"flags":null,"enclosureUrl":"https://www.youtube.com/v/_AUUM2GAk9g?version=3","enclosureMime":"","commentsUrl":null},{"title":"Nomad: Lightweight Orchestration That Complements Kubernetes- DevConf.IN 2026","url":"https://www.youtube.com/watch?v=ZdqcWquAKgI","date":1771423083,"author":"DevConf","guid":624,"unread":true,"content":"<article>Title: Nomad: Lightweight Orchestration That Complements Kubernetes\n\nSpeaker(s): Shaheen Sayyed\n\n---\nWhen it comes to orchestration, Kubernetes tends to steal the spotlight — but it’s not the only way to run workloads at scale. **HashiCorp Nomad** offers a simpler, lighter approach to scheduling containers, VMs, and even raw binaries — without the operational overhead.\n\nWe’ll explore what makes Nomad a practical alternative (or complement) to Kubernetes. You’ll learn the key building blocks — jobs, groups, clients, and allocations — and see how Nomad’s minimalist architecture can run production-grade workloads on a single binary. We’ll end with a live demo of deploying and scaling a containerized web app, showing that “easy to run” doesn’t mean “less capable.”\n\n---\n\n### **Key Takeaways**\n\n- **Understand** Nomad’s lightweight architecture and how it differs from Kubernetes.  \n- **See** a live demo of deploying and scaling a containerized service in minutes.  \n- **Discover** where Nomad fits — from small teams to hybrid and edge environments.\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":1201,"flags":null,"enclosureUrl":"https://www.youtube.com/v/ZdqcWquAKgI?version=3","enclosureMime":"","commentsUrl":null},{"title":"FusionStack: The Cross-Platform Blueprint - DevConf.IN 2026","url":"https://www.youtube.com/watch?v=ZDehU_MPDmc","date":1771423083,"author":"DevConf","guid":625,"unread":true,"content":"<article>Title: FusionStack: The Cross-Platform Blueprint\n\nSpeaker(s): Samson Dmello, Mandar Dixit\n\n---\n\nThis demonstration showcases a powerful, replicable model for managing and protecting traditional Virtual Machine (VM) workloads across a modern hybrid cloud environment. By unifying OpenShift Virtualization (KubeVirt) on-premise and on ROSA (Red Hat OpenShift Service on AWS) with the declarative automation power of Ansible Automation Platform, we eliminate manual complexity in key cloud mobility and resilience operations. We are  also leveraging power of  ecosystem by infusing Veeam solution to bridge Enterprise Data Protection requirement\n\n---\n\nFull schedule, including slides and other resources:\nhttps://pretalx.devconf.info/devconf-in-2026/schedule/</article>","contentLength":756,"flags":null,"enclosureUrl":"https://www.youtube.com/v/ZDehU_MPDmc?version=3","enclosureMime":"","commentsUrl":null}],"tags":["podcast"]}