{"id":"x7L2VSNEiyAFPo5H6bnPWAveyi4npegYaNeyr78Gjr6vQqtjp4cKiAbg9y6hcgadVzEqXA589jFXfyD","title":"Podcast Archives - Software Engineering Daily","displayTitle":"Podcast - Software Engineering Daily","url":"https://softwareengineeringdaily.com/category/podcast/feed","feedLink":"http://softwareengineeringdaily.com/category/all-episodes/exclusive-content/podcast/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":8,"items":[{"title":"Amazon’s IDE for Spec-Driven Development with David Yanacek","url":"https://softwareengineeringdaily.com/2026/02/26/amazons-ide-for-spec-driven-development-with-david-yanacek/?utm_source=rss&utm_medium=rss&utm_campaign=amazons-ide-for-spec-driven-development-with-david-yanacek","date":1772100014,"author":"SEDaily","guid":696,"unread":true,"content":"<p>AI-assisted coding tools have made it easier than ever to spin up prototypes, but turning those prototypes into reliable, production-grade systems remains a major challenge. Large language models are non-deterministic, prone to drift, and often lose track of intent over long development sessions.</p><p><a href=\"https://kiro.dev\">Kiro</a> is an AI-powered IDE that’s built around a spec-driven development workflow. It’s focused on helping developers capture intent up front, translate it into concrete requirements and designs, and systematically validate implementations through tasks, testing, and guardrails. It aims to preserve the creativity of AI-assisted development while producing software that is ready for real-world use.</p><p><a href=\"https://x.com/dyanacek\">David Yanacek</a> is a Senior Principal Engineer and a lead advisor on the Agentic AI team at AWS. Today, his work focuses on Kiro, frontier agents, Amazon Bedrock AgentCore, and AWS’s operational agents. He joins the show with Kevin Ball to discuss the design of Kiro, how spec-driven development changes the way teams work with AI coding agents, and what the next generation of agentic software development might look like.</p><div><p><a href=\"https://www.kball.llc/\">Kevin Ball</a> or KBall, is the vice president of engineering at Mento and an independent coach for engineers and engineering leaders. He co-founded and served as CTO for two companies, founded the San Diego JavaScript meetup, and organizes the AI inaction discussion group through Latent Space.</p></div>","contentLength":1414,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED1637876991.mp3","enclosureMime":"","commentsUrl":null},{"title":"Engineering AI Systems for Autonomy and Resilience with Krishna Sai","url":"https://softwareengineeringdaily.com/2026/02/24/engineering-ai-systems-for-autonomy-and-resilience-with-krishna-sai/?utm_source=rss&utm_medium=rss&utm_campaign=engineering-ai-systems-for-autonomy-and-resilience-with-krishna-sai","date":1771927239,"author":"SEDaily","guid":695,"unread":true,"content":"<p>Enterprise IT systems have grown into sprawling, highly distributed environments spanning cloud infrastructure, applications, data platforms, and increasingly AI-driven workloads. Observability tools have made it easier to collect metrics, logs, and traces, but understanding why systems fail and responding quickly remains a persistent challenge. As complexity continues to rise, the industry is looking beyond dashboards and alerts toward agentic AI systems that can reason about operational data, reduce toil, and take action when things go wrong.</p><p><a href=\"https://www.solarwinds.com\">SolarWinds</a> offers solutions to monitor, understand, and remediate issues across complex, distributed systems. The company began as a leader in network and infrastructure monitoring, and has evolved to support modern applications, cloud environments, containers, and AI workloads, with a growing focus on reducing operational toil.</p><p><a href=\"https://www.linkedin.com/in/krishnasai\">Krishna Sai</a> is the Chief Technology Officer at SolarWinds. He joins the show with Sean Falconer to discuss how SolarWinds is rethinking observability in the age of AI, what it means to design agentic systems for mission-critical environments, how AI-assisted programming is reshaping engineering workflows, and why the future of operations depends on building platforms where humans and autonomous agents work together.</p><p><em>Full Disclosure: This episode is sponsored by SolarWinds.</em></p>","contentLength":1356,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED2962747279.mp3","enclosureMime":"","commentsUrl":null},{"title":"Inside China’s Great Firewall with Jackson Sippe","url":"https://softwareengineeringdaily.com/2026/02/19/hacking-chinas-great-firewall-with-jackson-sippe/?utm_source=rss&utm_medium=rss&utm_campaign=hacking-chinas-great-firewall-with-jackson-sippe","date":1771495202,"author":"SEDaily","guid":694,"unread":true,"content":"<p>China’s Great Firewall is often spoken about but is rarely understood. It is one of the most sophisticated and opaque censorship systems on the planet, and it shapes how over a billion people interact with the global internet, influences the design of privacy and proxy tools worldwide, and continues to evolve in ways that challenge researchers, developers, and policymakers alike.</p><p><a href=\"https://www.linkedin.com/in/jackson-sippe/\">Jackson Sippe</a> is a PhD researcher at the University of Colorado Boulder whose work focuses on uncovering how national-scale censorship systems operate. Jackson recently helped lead a groundbreaking study analyzing a previously undocumented GFW technique that quietly broke fully encrypted proxy protocols across China for more than a year.</p><p>In this episode, Jackson joins Gregor Vand to discuss how the Great Firewall works at a technical level, the 2021–2023 blocking event, the popcount-based detection algorithm his team reverse-engineered, the cat-and-mouse ecosystem of censorship circumvention, and what these findings mean for the future of the open internet.</p>","contentLength":1050,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED8534787588.mp3","enclosureMime":"","commentsUrl":null},{"title":"Optimizing Agent Behavior in Production with Gideon Mendels","url":"https://softwareengineeringdaily.com/2026/02/17/optimizing-agent-behavior-in-production-with-gideon-mendels/?utm_source=rss&utm_medium=rss&utm_campaign=optimizing-agent-behavior-in-production-with-gideon-mendels","date":1771322415,"author":"SEDaily","guid":693,"unread":true,"content":"<p>LLM -powered systems continue to move steadily into production, but this process is presenting teams with challenges that traditional software practices don’t commonly encounter. Models and agents are non-deterministic systems, which makes it difficult to test changes, reason about failures, and confidently ship updates. This has created the need for new evaluation tooling designed specifically around the properties of LLMs.</p><p><a href=\"https://www.comet.com/\">Comet</a> is a platform with Roots and MLOps, to the rapidly evolving world of agent-based systems by treating prompts, tools, and workflows as optimizable components that can be evaluated and improved over time.</p><p><a href=\"https://www.linkedin.com/in/gideon-mendels/\">Gideon Mendels</a> is the co -founder and CEO of Comet. He previously worked at Google on hate speech and deception detection, and he founded GroupWise, which trained and deployed NLP models processing billions of chats. In this episode, Gideon joins Kevin Ball to discuss how agent development sits between software engineering and ML, why eVals are the missing foundation for most AI teams, prompt optimization as a search problem, and the future for continuously improving agents in production.</p><p><em>Full Disclosure: This episode is sponsored by Comet.</em></p><div><p><a href=\"https://www.kball.llc/\">Kevin Ball</a> or KBall, is the vice president of engineering at Mento and an independent coach for engineers and engineering leaders. He co-founded and served as CTO for two companies, founded the San Diego JavaScript meetup, and organizes the AI inaction discussion group through Latent Space.</p></div>","contentLength":1474,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED9081665534.mp3","enclosureMime":"","commentsUrl":null},{"title":"Gas Town, Beads, and the Rise of Agentic Development with Steve Yegge","url":"https://softwareengineeringdaily.com/2026/02/12/gas-town-beads-and-the-rise-of-agentic-development-with-steve-yegge/?utm_source=rss&utm_medium=rss&utm_campaign=gas-town-beads-and-the-rise-of-agentic-development-with-steve-yegge","date":1770890451,"author":"SEDaily","guid":692,"unread":true,"content":"<p>AI-assisted programming has moved far beyond autocomplete. Large language models are now capable of editing entire codebases, coordinating long-running tasks, and collaborating across multiple systems. As these capabilities mature, the core challenge in software development is shifting away from writing code and toward orchestrating work, managing context, and maintaining shared understanding across fleets of agents.</p><p><a href=\"https://x.com/Steve_Yegge\">Steve Yegge</a> is a software engineer, writer, and industry veteran whose essays have shaped how many developers think about their work. Over the past year, Steve has been exploring the frontier of agentic software development, building tools like Beads and Gas Town to experiment with multi-agent coordination, shared memory, and AI-driven software workflows.</p><p>In this episode, Steve joins Kevin Ball to discuss the evolution of AI coding from chat-based assistance to full agent orchestration, the technical and cognitive challenges of managing fleets of agents, how concepts like task graphs and Git-backed ledgers change the nature of work, and what these shifts mean for software teams, tooling, and the future of the industry.</p>","contentLength":1147,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED8427767061.mp3","enclosureMime":"","commentsUrl":null},{"title":"Python 3.14 with Łukasz Langa","url":"https://softwareengineeringdaily.com/2026/02/10/python-3-14-with-lukasz-langa/?utm_source=rss&utm_medium=rss&utm_campaign=python-3-14-with-lukasz-langa","date":1770717618,"author":"SEDaily","guid":691,"unread":true,"content":"<p><a href=\"https://www.python.org/\">Python</a> 3.14 is here and continues Python’s evolution toward greater performance, scalability, and usability. The new release formally supports free-threaded, no-GIL mode, introduces template string literals, and implements deferred evaluation of type annotations. It also includes new debugging and profiling tools, along with many other features.</p><p><a href=\"https://x.com/llanga\">Łukasz Langa</a> is the CPython Developer in Residence at the Python Software Foundation, and he joins Sean Falconer to discuss the 3.14 release, the future of free threading, type system improvements, Python’s growing role in AI, and how the language continues to evolve while maintaining its commitment to backward compatibility.</p><div><p>Sean’s been an academic, startup founder, and Googler. He has published works covering a wide range of topics from AI to quantum computing. Currently, Sean is an AI Entrepreneur in Residence at Confluent where he works on AI strategy and thought leadership. You can connect with Sean on LinkedIn.</p></div>","contentLength":977,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED4837519291.mp3","enclosureMime":"","commentsUrl":null},{"title":"Airbnb’s Open-Source GraphQL Framework with Adam Miskiewicz","url":"https://softwareengineeringdaily.com/2026/02/05/airbnbs-open-source-graphql-framework-with-adam-miskiewicz/?utm_source=rss&utm_medium=rss&utm_campaign=airbnbs-open-source-graphql-framework-with-adam-miskiewicz","date":1770285600,"author":"SEDaily","guid":690,"unread":true,"content":"<p>Engineering teams often build microservices as their systems grow, but over time this can lead to a fragmented ecosystem with scattered data access patterns, duplicated business logic, and an uneven developer experience. A unified data graph with a consistent execution layer helps address these challenges by centralizing schema, simplifying how teams compose functionality, and reducing operational overhead while preserving performance and reliability.</p><p>Viaduct is Airbnb’s open-source, data-oriented service mesh and GraphQL platform built around a single, highly connected central schema. It has played a major role in scaling Airbnb’s engineering organization.</p><p><a href=\"https://x.com/skevy\">Adam Miskiewicz</a> is a Principal Software Engineer at <a href=\"https://www.airbnb.com/\">Airbnb</a> and he worked on Viaduct. He joins the podcast with Gregor Vand to talk about how Viaduct originated inside Airbnb, the architectural principles that shaped it, the challenges of scaling GraphQL to millions of queries per second, and why the team decided to open-source the platform. They also discuss the future of backend development in an AI-driven world and how unified data layers may influence the next generation of engineering systems.</p>","contentLength":1170,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED7680215734.mp3","enclosureMime":"","commentsUrl":null},{"title":"SED News: Apple Bets on Gemini, Google’s AI Advantage, and the Talent Arms Race","url":"https://softwareengineeringdaily.com/2026/02/03/sed-news-apple-bets-on-gemini-googles-ai-advantage-and-the-talent-arms-race/?utm_source=rss&utm_medium=rss&utm_campaign=sed-news-apple-bets-on-gemini-googles-ai-advantage-and-the-talent-arms-race","date":1770112831,"author":"SEDaily","guid":689,"unread":true,"content":"<p>SED News is a monthly podcast from Software Engineering Daily where hosts Gregor Vand and Sean Falconer unpack the biggest stories shaping software engineering, Silicon Valley, and the broader tech industry.</p><p>In this episode, they cover <a href=\"https://starlink.com/\">Starlink</a>’s rapid rollout of free, high-speed in-flight internet, <a href=\"https://www.tesla.com/\">Tesla</a>’s move to deprecate Autopilot in favor of full self-driving, and <a href=\"https://www.apple.com/\">Apple</a>’s reported decision to power Siri with <a href=\"https://www.google.com/\">Google</a>’s Gemini models. They also discuss <a href=\"https://business.facebook.com/\">Meta</a>’s $2B acquisition of <a href=\"https://manus.im/\">Manus</a>, <a href=\"https://waymo.com/\">Waymo</a>’s growing pains as autonomous vehicles scale, and the competitive shockwaves triggered by Google’s advances in custom AI hardware.</p><p>Gregor and Sean then dive deep into the state of the tech job market, examining <a href=\"https://openai.com/\">OpenA</a>I’s decision to eliminate vesting cliffs, the escalating war for elite AI talent, and what recent layoffs really say about the future of software engineering. They explore how AI coding tools are reshaping the balance between junior and senior engineers, why fundamentals still matter, and what developers should focus on heading into 2026.</p><p>Finally, they highlight standout threads from Hacker News, including Doom running on wireless earbuds, the enduring appeal of wildly over-engineered side projects, and why hacking for fun still matters in an age of industrial-scale AI.</p>","contentLength":1303,"flags":null,"enclosureUrl":"https://traffic.megaphone.fm/SED5113011729.mp3","enclosureMime":"","commentsUrl":null}],"tags":["podcast"]}